[
  {
    "title": "Weekly Rumours, Speculation, Questions, and Reaction Megathread - 30/03/25",
    "comments": [
      {
        "body": "With this talk of Adolescence being shown in schools, I can't help but think it's a response that misses the point. The kids already know shit's fucked! Surely this show was made to be shown to the grown ups who don't know anything about the worlds their kids occupy. If anything it needs to be shown in work places in place of HR meetings lol",
        "replies": [
          {
            "body": "Now we just need a “gritty masterpiece” about NIMBYism. \n\nA single shot starting with a boomer attending a council meeting to block the building of a new block of accessibility and age adapted flats alongside new energy infrastructure, ending with them freezing to death in a four bed they can’t heat because no infrastructure connects to their street and the listed status of a nearby lamppost and its protected view of a communal dustbin means they can’t install double glazing.",
            "replies": [
              {
                "body": "Is the lack of punctuation in your second paragraph a metaphor for the single-shot take that will be required?",
                "replies": [
                  {
                    "body": "It’s like Cormac McCarthy’s writing. Artistic genius",
                    "replies": []
                  },
                  {
                    "body": "😉",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "body": "Isn't it kind of condescending too? \"Hey kids, here's a TV show some adults made about how you might end up murdering one of your classmates if you don't bring your screentime down below five hours\"",
            "replies": [
              {
                "body": "It's like the most intense Grange Hill *issues* storyline ever.",
                "replies": []
              }
            ]
          },
          {
            "body": "Yeah considering Andrew Tate and his sort try to radicalise young men by talking about how society is against them, I'm not sure that taking almost an entire school day's worth of time to force classrooms to watch it is really going to help dispel the punished for being male feeling.\n\nIf anything having an entire generation of social media accessing kids watching something in school is just going to completely destroy the weightiness of it and get it memed to fuck.",
            "replies": [
              {
                "body": "Yeah, I thought it was a fantastic show. Touches on real topics and real problems but it is fictional, not really something to learn from. Used to start a conversation at most but like you say a 4 hour video to do that is unnecessary.\n\nI think the average young male at risk will identify with some of the character but the vast majority will not identify with stabbing a girl repeatedly and they may see it as an attempt to portray them as evil and dangerous.",
                "replies": [
                  {
                    "body": "Yeah it wouldn't really be too hard for one of the grifters to argue that \"they want you to feel guilty for something you didn't do\".",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "body": "I'm struggling to think how you can effectively use a four hour miniseries as a teaching tool anyway, and this is before I even consider how you'd adapt a piece of drama intended for an adult audience into a meaningful sequence of learning for 11-16 year olds. \n\n\nAt a quick estimate you probably need about 12 hours of lessons to do this even halfway properly.  And they'll need to be fully resourced, and cpd time allocated to training staff to deliver it.",
            "replies": []
          },
          {
            "body": "The amount people in politics and the media go on about it I swear they're on commission.",
            "replies": []
          }
        ]
      },
      {
        "body": "If I was Justin Welby, I would not be going on TV. The man has no shame.",
        "replies": [
          {
            "body": "I think it takes a certain amount of ego to become a public figure, which is great when you're climbing the ladder but terrible in situations like this. Justin Welby needs to stop talking to journalists and live out the rest of his life in private until the inevitable inquiry comes up but his ego won't let him. \n\nIt reminds me of the Greg Wallace and John Barrowman stuff. All Greg Wallace needed to do was put out a 'Sorry for inappropriate comments' statement and everyone would have moved on within 10 minutes and he'd still have a career. All John Barrowman needed to do was put out on a sincere apology and he'd still have a career. Their egos won't let them do the obvious thing and they end up talking absolute nonsense to any journalist willing to listen.",
            "replies": []
          },
          {
            "body": "The headline on BBC News (Welby: “I forgive serial abuser John Smyth”) is a disaster. What he actually says is reasonable (I’d forgive him personally but that’s not particularly relevant, wouldn’t tell victims they must forgive, etc.) but that’s an awful headline. Not his suggestion obviously but should have done everything to avoid that.",
            "replies": [
              {
                "body": ">The headline on BBC News [insert headline here] is a disaster. \n\n\nJust save this template for future ease of use.",
                "replies": []
              }
            ]
          },
          {
            "body": "Seriously, what happened to the idea of disgraced people just fading away into the background. Maybe doing some quiet charity work but not appearing on TV or doing newspaper columns and interviews.",
            "replies": []
          },
          {
            "body": "[deleted]",
            "replies": [
              {
                "body": "Yeah, \"there was just too much noncing for me to stop it, so you should all just forgive me\" is a pretty amazing excuse.",
                "replies": []
              },
              {
                "body": "Good analogy.\n\nWhen we heard this yesterday from Welby we were utterly non-plussed.\n\nAnd even though other comments show it is misleading, the BBC headline this morning *Welby: I forgive serial abuser John Smyth* makes him look like a right plonker.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "i think we should replace 5p and 10p coins with shillings and florin respectively. this is unlikely to fix much or have any real benefit at all but it would mean we'll be saying the words \"shilling\" and \"florin\" a lot more so i think overall it's worth starmer looking into",
        "replies": [
          {
            "body": "On a related note, the half penny was abolished in the mid-80s as it was considered pointless. However, adjusted for inflation, the 2p coin of today is equivalent to the half-penny of the 80s, and so the 1p coin would be worth a quarter penny. \n\nCurrently, the scrap value of a 1p coin is estimated to be about 3-5p. The only thing stopping people from just melting down the entire supply to make a profit is [Section 10 of the Coinage Act 1971](https://www.legislation.gov.uk/ukpga/1971/24/section/10) which states:\n\n>No person shall, except under the authority of a licence granted by the Treasury, melt down or break up any metal coin which is for the time being current in the United Kingdom or which, having been current there, has at any time after 16th May 1969 ceased to be so.\n\nI am curious about the legalities of sailing offshore (or just driving to Ireland) for this purpose as at some point it will become sufficiently profitable to do so.",
            "replies": []
          },
          {
            "body": "Throw in some \"doubloons\" and you get my vote.",
            "replies": []
          },
          {
            "body": "Much more sensible to adopt the Monster Raving idea of a 99p coin.\n\nIIRC some of their very old policies ended up going mainstream so they are a good source of ideas.",
            "replies": []
          },
          {
            "body": "Make Coingage Groat Again",
            "replies": []
          }
        ]
      },
      {
        "body": "I knew Brexit was about being hit less hard by insane arbitrary US tariffs than the EU (that nobody could have possibly predicted 9 years ago). \n\nEven when it was about sovereignty, immigration and fishing, I knew it was about that.",
        "replies": [
          {
            "body": "Brexit has become about whatever you need it to be about to serve your interests in this very moment.\n\nCongratulations, you have ascended to true Nigel Faragehood.",
            "replies": [
              {
                "body": ">Brexit has become about whatever you need it to be about to serve your interests in this very moment.\n\nItalwayswas.jpeg",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "It's coming up to 9 months in office for the Labour government. \n\nI would sum it all up to say that they've pursued a fairly sensible, if unimaginative, policy agenda in a politically naive way. I'm personally disappointed that they didn't have more 'oven ready' initiatives to put into action after a solid 4 years of preparation time. Also, it seems to me that the team around Starmer/Reeves has lacked the kind of talent that Blair could draw on - which might be a consequence of Labour having a fairly easy journey to power in the end. No one was ever really tested. \n\nThoughts? Am I being unfair?",
        "replies": [
          {
            "body": "I really thought they had more up their sleeves for an immediate agenda. They lost control of the narrative almost immediately and have never got it back.",
            "replies": []
          },
          {
            "body": "A challenge is that the public is fundamentally unreasonable. The government took a hugely expensive decision to keep the country going during COVID. I think at the time most supported furlough etc but the reality is that the time to foot that bill has arrived and everyone is going to have to wear it to some degree. In reality many have forgotten Covid even happened and others just want it to be another group in society who pay.",
            "replies": []
          },
          {
            "body": "> disappointed\n\nThat word sums it up.",
            "replies": []
          },
          {
            "body": "It's pretty clear that the Tories gave up on governing the country after the Truss debacle so we had two years of can kicking. In that time we had runaway inflation, very little economic growth, interest rates were going up and things like public sector strikes were allowed to fester. We also had no economic strategy and still had the self-imposed ban on windfarms, immigration was allowed to build up and that stoked up social issues and more. \n\nStarmer took over at a very low point and is now getting grief because he hasn't made things magically better in nine months, if it was that easy then even the Tories would have turned things around. There's some commentary that he's been too cautious but I get the caution as a necessary means to get elected and things like the fiscal rules have hampered room to move. People like to make the comparison with Blair but took over a stable economy, there was no Ukraine war, we were in the EU, interest rates and inflation were stable and he didn't have a US president intent on causing global economic chaos. Blair though got grief by promising to stick to John Major's/Ken Clarke's spending commitments for two years after the election, many people then called him overly cautious and that we were losing an opportunity to act.",
            "replies": []
          },
          {
            "body": "Political nerds can talk about the work being done behind the  scenes but all I can think of that's had an impact on peoples day to day like so far is the NI employers hike , resulting in lower pay offerings. \n\nI was hoping they'd come out the gates with some easy light touch pieces, limiting tickets resale costs buying face value for example, which should have rattled through parliament. I know there is stuff they are working on like that, but it should have been done and ready. \n\nThey have been so spectacularly poor on Comms that they should have had 50 odd feel good policies that they can trott out once a week or so.",
            "replies": []
          },
          {
            "body": "With the caveat that I don't think we can truly say how successful the first nine months have been until the day after the next election I think if anything you're being too fair on them.\n\n\nThe government has roped itself into a horrible fiscal situation with zero wiggle room. Unless growth magically comes or the global economy does a 180 they are going to be stuck in a doom loop of having the come back with more cuts/tax rises ever six months to meet the rules.",
            "replies": []
          }
        ]
      },
      {
        "body": "Is it just me or does everyone else automatically assume that posts and comments with censored swear words were written by a ‘tourist’ or an LLM?\n\nIt’s genuinely not a bad heuristic in my opinion, maybe I’m drawing a spurious correlation but the bots and the influx of people prissy about swearing seemed to happen at the same time.",
        "replies": [
          {
            "body": "IIRC comments get deleted if the use too many no-no words. The old hard-C in particular (which is cultural discrimination frankly).",
            "replies": [
              {
                "body": "The true cultural discrimination is that ‘w⚓️’ is an automatic removal.",
                "replies": [
                  {
                    "body": "That’s barely even a swear word!",
                    "replies": [
                      {
                        "body": "I think it’s one of those ones where people don’t agree on the severity, some think ‘bugger/buggery’ is a swear word as well for example.",
                        "replies": [
                          {
                            "body": "Funnily enough; no problem with bugger wouldn’t say buggery is a swear word but would be hesitant dropping it in casual conversation…depending on the context.",
                            "replies": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "body": "Hate crime against Australians.",
                "replies": []
              }
            ]
          },
          {
            "body": "No, automod is a fash sometimes. I post pol-related extracts from popb*tch occasionally and it's very hit or miss whether the posts are stealth hidden for having that swear in.",
            "replies": [
              {
                "body": "Some of it is reddit itself interestingly, any outgoing links to an RU TLD gets your comment removed and even the mods can’t approve it.\n\nIn a hilarious twist of irony this happened to me when I was quoting an Orwell essay which happened to be hosted on an RU domain.",
                "replies": []
              }
            ]
          },
          {
            "body": "In the future, typing slurs will be the only way to prove you're human.",
            "replies": []
          }
        ]
      },
      {
        "body": "Good chance the UK has the highest growing (or more likely - slowest declining) economy in the G7 \n\nManifesto commitment achieved!",
        "replies": [
          {
            "body": "*The second finger on Kier Starmer’s monkey paw curls closed.*",
            "replies": []
          },
          {
            "body": ">do nothing\n\n>win\n\nFrom electoral strategy to economic strategy",
            "replies": []
          },
          {
            "body": "Can't be hurt by American tariffs if you don't export them much. \n\n*taps forehead* \n\nUp yours, Delors! Your move next Brussels!",
            "replies": []
          }
        ]
      },
      {
        "body": "Slightly meta question to the mods, but the increase in posting from official sources (papers, and now the govt) has me wondering. How do these accounts verify themselves? Is it different for the govt than a paper? Is there a limit of fame that means you can be verified?",
        "replies": [
          {
            "body": "For publications, we typically ask for an e-mail from an official e-mail address to confirm the identity of the account.\n\nFor the government, they have verified through the official Reddit verification scheme and came to us through the Reddit admins.\n\nWe typically reserve the \"Verified\" tag and green flair for big publications and AMA guests. We're not in the business of verifying all and sundry.",
            "replies": [
              {
                "body": "Interesting, I was unaware of the official Reddit Verification scheme but it definitely makes sense for government accounts. Thanks for the reply!",
                "replies": []
              }
            ]
          },
          {
            "body": "I had to post a picture of my username and date spelled out on a chapati using a curry of the mods' choosing.",
            "replies": [
              {
                "body": "I'm still impressed you managed to source an alpaca vindaloo.",
                "replies": []
              },
              {
                "body": "What was the curry of choice for the mods? My gut tells me korma",
                "replies": [
                  {
                    "body": "Alpaca Achari, Carrot-Carrot-Korma, Chicken VindalooptioMkIx, ITMadras or CaravanOfDopiaza.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "Have the government actually announced anything to address the ludicrous situation with the water industry?\n\nOr are we just supposed to view monopoly’s continually slapping consumers with double digit price rises as a perfectly normal thing?\n\nAnd no, banning bosses bonuses is not an adequate fix.",
        "replies": [
          {
            "body": "Well they're letting Thames Water accumulate another £3bn on debt at high interest so as to put off the problem of it being bankrupt a few more months.",
            "replies": [
              {
                "body": "Thank goodness that this government has got a grip, and moved beyond sticking plaster politics.",
                "replies": []
              }
            ]
          },
          {
            "body": "Ofwat has approved every bill increase and investment plan (not immediately, but it’s negotiated with with Ofwat) since privatisation.\n\nThe most recent bill increase comes with conditions on what investments need to be done in the water network.\n\nSo in effect yes the government has done stuff, they’ve signed off the increase",
            "replies": []
          },
          {
            "body": "The system is in need of the investment and the government would much rather the private companies raised bills than them.",
            "replies": []
          }
        ]
      },
      {
        "body": "GBP/USD now approaching +1.5% (almost $1.32) today. Notionally, we're now 5.4% more powerful as a consumer base than one year ago.",
        "replies": [
          {
            "body": "This is like a doctor telling you you’re about to save a lot of money on hair cuts.",
            "replies": [
              {
                "body": "You're going to save 50% on new shoes!",
                "replies": []
              }
            ]
          },
          {
            "body": "Remember to say thank you",
            "replies": []
          },
          {
            "body": "Except that also makes manufactured goods more expensive abroad…",
            "replies": [
              {
                "body": "Only more expensive in the US if all currencies track, and the US government are going to make that happen regardless anyway.",
                "replies": []
              },
              {
                "body": "We overwhelmingly export services to the US that the hit is much more limited than most of our peers.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "We made it to British Summer Time lads",
        "replies": [
          {
            "body": "Good morning to all who celebrate national jet-lag day. ",
            "replies": [
              {
                "body": "Seriously, I woke up feeling like I’d been flown across the Atlantic and back in my sleep. 🙃",
                "replies": []
              },
              {
                "body": "We flew back from Spain yesterday so we’re a little all over the place, forwards then back then forwards again.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "\nAccidentally put my passport in the washing machine and I wanted to spend a couple of days living in denial that it’s still ok to travel with until I order a replacement, but then I remembered the price is going up this month and I need to get on it ASAP. \n\nAt least the Passport Office is one of the few parts of this country that still works. Why don’t we get the people who run the Passport Office to run the rest of the country as well.",
        "replies": [
          {
            "body": "Abi Tierney's who sorted the Passport Office. She is currently sorting out the Welsh Rugby Union. I'm guessing salary's a factor here.",
            "replies": [
              {
                "body": "\"Sorting out\". She's been an abject failure at the WRU thus far, so I wouldn't hold out too much hope. ",
                "replies": []
              },
              {
                "body": "So you are saying that Wales will win the 6 nations grand slam next year?",
                "replies": [
                  {
                    "body": "No, but they will attend all the matches bang on time.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "Man... I *hate* the 2020s so far. \n\nWhat's one thing that's better?",
        "replies": [
          {
            "body": "The Elizabeth line is nice",
            "replies": []
          },
          {
            "body": "Violent crime has fallen steadily with murders, rape, and assault all falling, infact, the only real crime that's risen is the aggravated overuse of commas, but the government is hoping to reduce that, by introducing longer sentences.",
            "replies": [
              {
                "body": "Booooo",
                "replies": []
              }
            ]
          },
          {
            "body": "Much better rates of WFH or hybrid working for some professions.",
            "replies": []
          },
          {
            "body": "The national grid is now powered more by renewable resources. Yesterday afternoon, it was so plentiful that wholesale energy had a negative price.\n\nhttps://grid.iamkate.com/\n\n[NB you could see the partial eclipse on the solar output](https://bsky.app/profile/simonoxfphys.com/post/3lljdt6baj22c)",
            "replies": [
              {
                "body": "It's a shame our energy system is so mental that we still ended up paying above gas prices for wind and solar.",
                "replies": []
              },
              {
                "body": "That's quality. And excellent news that we have so much PV now that a partial eclipse has a noticeable impact on the energy mix.",
                "replies": []
              }
            ]
          },
          {
            "body": "MRNA vaccines seem to be pretty great.",
            "replies": []
          },
          {
            "body": "Boris isn't PM anymore. \n\n\nStar Trek Strange New Worlds is very good.\n\n\nPreston is getting a replacement for the old tram bridge. ",
            "replies": []
          }
        ]
      },
      {
        "body": "Introducing: The Parliamentary Supremacy Strikes Back!\n\nThe Government has today tabled the [Sentencing Guidelines (Pre-sentence Reports) Bill](https://bills.parliament.uk/bills/3955), which you will be shocked to learn amends the Coroners and Justice Act 2009 that defines the Sentencing Council's responsibility by saying:\n\n>sentencing guidelines about pre-sentence reports may not include provision framed by reference to different personal characteristics of an offender.”\n\n>For the purposes of this section— “personal characteristics” include, in particular— (a) race; (b) (c) religion or belief; cultural background;\n\nI must say, I do also admire Starmer's legislative stat padding by introducing lots of very short Bills to say 'But look how much legislation I passed!'",
        "replies": [
          {
            "body": ">(a) race; (b) (c) religion or belief; cultural background;\n\nThey left gender off of there which remains strange",
            "replies": [
              {
                "body": "Probably because it would get in the way of their policy of shutting down women’s prisons and sending fewer women to prison. No way to do that without sentencing men and women differently based purely on their gender.",
                "replies": []
              }
            ]
          },
          {
            "body": "I don’t really know why it wasn’t fixed by a conversation. It was a non-issue that looked bad, now the council is going to be bound by law. Bit of an own goal",
            "replies": [
              {
                "body": "I suppose if they wanted some top shithousery, they could argue that the prohibition on \"provision framed by reference to different personal characteristics of an offender\" precludes a pre-sentencing report from saying anything at all.",
                "replies": []
              }
            ]
          },
          {
            "body": "Does shorter legislation get through parliament quicker? I know usually it takes ages, but is that because it’s a gazillion pages long and being analysed in detail?",
            "replies": [
              {
                "body": "Basically, yes.\n\nA short Bill won't have many potential amendments or require much debate at 2nd Reading. If nobody feels the need for much debate, it can happen very fast indeed.\n\nFor example, the [Church of Scotland (Lord High Commissioner) Bill](https://bills.parliament.uk/bills/3936) had Second Reading on 4th March, and passed without a division.\n\nThe bill was referred to a Committee of the Whole House (what technically counts as a Committee but includes every member and sits in the main chamber).\n\nThe Committee (which consisted of the same people sitting in the same place) immediately began proceedings, proposed no amendments and then reported the Bill back to the House.\n\nThe Bill then passed at Report without debate and after a brief valedictory 3rd Reading, was passed by the Commons.\n\nSo, the Bill started it's Commons journey at 4.15pm, completed all stages and was on it's way across the Central Lobby to the Lords by 5.06pm.\n\n[https://hansard.parliament.uk/Commons/2025-03-04/debates/225258A8-DAAD-47C0-95B8-E30AEAF60780/ChurchOfScotland(LordHighCommissioner)Bill](https://hansard.parliament.uk/Commons/2025-03-04/debates/225258A8-DAAD-47C0-95B8-E30AEAF60780/ChurchOfScotland(LordHighCommissioner)Bill)\n\n[https://hansard.parliament.uk/Commons/2025-03-04/debates/748DC1AB-ABAF-46D7-8B0F-9B0CC9AB918C/ChurchOfScotland(LordHighCommissioner)Bill](https://hansard.parliament.uk/Commons/2025-03-04/debates/748DC1AB-ABAF-46D7-8B0F-9B0CC9AB918C/ChurchOfScotland(LordHighCommissioner)Bill)",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "The pound is already up nearly 1% against the dollar and it’s not even 9am. \n\nThis is good for us as a service-based exporter and helps increase British consumer purchasing power.",
        "replies": [
          {
            "body": "I wonder what the longer term impact on the UK stock market will be, for years it's been the case that the general wisdom was \"invest in the US market if you want to see big returns\", with the UK markets considered too small to be worth bothering with.",
            "replies": []
          },
          {
            "body": ">This is good for us as a service-based exporter\n\nNot if you sell your services to the USA priced in dollars.",
            "replies": []
          }
        ]
      },
      {
        "body": "I'm feeling rather nostalgic. The whole political conversation over the past weeks and months has been getting much more economical, monetary, and fiscal in nature. It feels like the good old days when Brown was Prime Minister.",
        "replies": [
          {
            "body": "Just in time for another financial crisis!",
            "replies": [
              {
                "body": "I'm immensely privileged to have experienced two \"once-in-a-life-time\" financial disasters with not only the Great Recession but now the Trump Dump as well. Perhaps even three if we were counting the COVID recession. \n\nIt's great our global economic system is so stable and robust, and not at mercy from the brain rot of one man.",
                "replies": [
                  {
                    "body": "I've also lived through the early 70s disasterous Heath/Barber inflationary budget, Thatcher causing a recession in the early 80s, the late 80s property boom/crash caused by removal of MIRAS, the early 90s crash caused by joining the ERM at too high a rate and the dot com boom and crash.\n\nThese once in a lifetime events appear to happen every 8 years.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "Can't believe we're at a place where I saw Russell Brand being charged and my first thought was \"something about this will come up in the tariffs negotiations.\"",
        "replies": [
          {
            "body": "> \"something about this will come up in the tariffs negotiations.\"\n\nHe will claim he's being persecuted for his speech. \n\nThe Americans will use this as an excuse to talk about how the UK needs to respect people's freedom of speech if they want to trade with the US",
            "replies": []
          }
        ]
      },
      {
        "body": "I say we let judges get creative with punishments.  Jails are full, recidivism is high, and just giving out fines doesn't stop folks.\n\nSome studies have shown the use of alternative punishment can reduce reoffending when it's specifically tailored to make the criminal think about what they did.\n\nRun from a taxi without paying: Imposed 30 mile walk down the A65.\n\nDenting another car and driving away: Must hand-write and leave a confessional apology note on the windscreens of every car in a multi-story carpark.\n\nThat kind of thing.",
        "replies": [
          {
            "body": "I think you are on to something with this walk down the A65 punishment. We should replace prisons with walking down the side of busy roads for increasing distances. Maybe with side objectives to complete. For example, a murderer may be sentenced to walk 280 miles up the side of the A1 but can have it reduced if they report enough cars speeding. \n\nIt would also help fight against the disgracefully positive image surrounding walking if every second person walking was a hardened criminal.",
            "replies": []
          },
          {
            "body": "[deleted]",
            "replies": []
          },
          {
            "body": "[Have you been watching Legal Eagle as well?](https://www.youtube.com/watch?v=ZFFbpl9SOXE)",
            "replies": [
              {
                "body": "Not recently, although I do like his work.  Stopped watching recently as everything was, understandably, 100% Trump and Musk.  Looks like he's branching out again though.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "I'm going to boldly suggest that it seems that nobody is actually sure what's going on with the negotiations with the US.\n\nIn the last couple of hours there have been posts from the Telegraph which says that free speech is an issue in the talks whereas the FT article states its not been brought up by the trade delegation and Steven Swinford (the Times) suggesting that a deal is close buy will be after initial tariffs which is in opposition to the FTs understanding.\n\nI'm inclined to believe the FT but more likely is that because the Trump administration is what it is then there are just contradictory rumours flying with nothing confirmed.",
        "replies": [
          {
            "body": "I doubt the American negotiators are sure on what their own government’s position is at this point.",
            "replies": []
          },
          {
            "body": "Complaints about free speech in other countries feels more for domestic US consumption than a trade issue.",
            "replies": []
          },
          {
            "body": "Given the Telegraph have repeatedly acted like they are Trump whisperers and know what he will do, and consistently been wrong over that, I am decidedly not trusting them over it.",
            "replies": []
          }
        ]
      },
      {
        "body": "[BBC Live News Feed](https://www.bbc.co.uk/news/live/c1dr7vy39eet?post=asset%3A4d8076d2-ad87-4708-9824-ff032e8f2fd2#post)\n\n> UK Prime Minister Keir Starmer tells business chiefs in Downing Street that \"clearly there will be an economic impact\" from Trump's tariffs - but the government will respond with \"cool and calm heads\".\n\nThe implication being, of course, that these tariffs are the work of someone who has neither a cool nor a calm head.",
        "replies": []
      },
      {
        "body": "A friend of mine just shared a post from their local councillor celebrating the imminent opening of a new chippy. They're particularly proud that it'll be doing discounted chips for kids during lunchtime. \n\nAnd you know what, I kind of love that. It's exactly the kind of super  local nonsense a councillor should be thinking about. Celebrating new local businesses and jobs, with a bit of a fun added.",
        "replies": []
      },
      {
        "body": "That Reform party political on BBC1 was… weird. Lots of shots of Farage et al at a podium, looking strong (apparently) but in an arena with such high contrast it looked like they were shouting into an empty room. It as was really only the end where they managed to show a shot of some of the crowd. And the whole thing felt very… not local… while trying to sell people that they were going to be standing in the locals.\n\nPPBs are cringe worthy at the best of times but this one was just plain odd. Roll up, roll up for the Farage show.",
        "replies": [
          {
            "body": "It's by design. A symptom of all of Farages ventures is that talented people aren't allowed to work in them. Because they think for themselves and can become a threat to old Nigel. Farage is always terrified of being usurped, so he does this.\n\nNigel's parties attract losers like flies to shit.\n\nHis old UKIP HQ in Thanet used to be the most Brexit place in the country, they had a taste of the Farage governance and kicked UKIP out and became a co op labour/con/ind council. You visit now and you see EU flags all over the place in Margate, it's mental how much it's changed just because of how useless UKIP were. \n\nThe young ones unfortunate enough to live in a Farage target area here are in for a treat with Reform local governmnet.",
            "replies": []
          },
          {
            "body": "They're sending out \"local election\" targeted post with Farage's face plastered on them with no mention of local candidates or policy. Just that council tax is high, building houses is bad and immigration is the cause of all our problems.",
            "replies": []
          }
        ]
      },
      {
        "body": "My half-French wife is not as into politics as much as folks around here.  Knows the headlines, but not the details.\n\nSo for April Fools today I have convinced her that Marie Le Pen has joined Reform after being barred from running in France, and this morning's polls show she's boosted them even further and she's now favourite to become the next PM.\n\nShe's not been this angry since I told her the Bradford student Union had voted on a symbolic statement demanding all females on campus wear burkas.",
        "replies": [
          {
            "body": "This is a supervillain origin story if ever I heard one.",
            "replies": []
          },
          {
            "body": ">not as into politics as much as folks around here. Knows the headlines, but not the details.\n\nI think you're exaggerating the depth of details beyond the headlines that are understood by the vast majority of commenters here ;)",
            "replies": []
          },
          {
            "body": "If were in your family, I would make sure to be away on a no-communication retreat of some kind across 1st April every singe year. It would be the only way to be sure.",
            "replies": []
          }
        ]
      },
      {
        "body": "Glad to see parking companies getting their comeuppance. I can't believe they actually want to appeal this as well, I imagine the entire company is full of computer-says-no absolute jobsworths though https://www.bbc.co.uk/news/articles/c2040xy9yn6o \n\nHas anyone talked about the practise of just putting up a sign full of tiny text legalese and non standard diagrams to lay out their \"contract\" is. There's those on the estate I live on, I only know what it means because I live here and got caught out by it when I first moved. I don't think it actually describes the parking situation around here.",
        "replies": [
          {
            "body": "They rely on thre things.\n\n\n1. People who can't be arsed to fight anything and just roll over when companies bully them.\n\n\n2. People who go off half cocked, male stupid mistakes and then lose in court giving the parking firms favourable rullings to fight.\n\n\n3. When somone fights back in a calm and collected way they drop it before it reaches court.\n\n\nIt's how they get away with it so long. Perhaps the third group should LARP as the second group.",
            "replies": []
          },
          {
            "body": "I think they are scummy as well. There was a free car park in town that changed from being free for customers of the shops it served to being run by one of these companies and requiring people to get tickets with their registration on in one of the shops (something like a Lidl and a B&M). It caught a lot of people out in the early days including a couple of people I worked with who were not on very much money at the time and also didn't realise that the fines were not quite the same as getting one from a council car park.",
            "replies": []
          }
        ]
      },
      {
        "body": "I don't see how the lives and opportunities of younger people can meaningfully improve until the older generations naturally become a smaller voting block.\n\nWe need more affordable housing and to remove the triple lock.\n\nThat won't happen anytime soon because it's in the interests of elderly people to keep house building low and to keep the triple lock.\n\nThey vote more than younger people.\n\nUnless there's a huge culture shift and young people start voting more.",
        "replies": [
          {
            "body": "I’m older and I’m massively in favour of lowering voting age to 16. It’s their future, they should have a vote, and it’s a nice marker of transitioning from compulsory GCSEs to choosing A-levels etc. For many 16 is the age at which you start actively making serious choices about your future. \n\nHowever when lowering voting to 16 is mentioned in UKPol there’s always lots of comments against it. Which makes me sad. It’s yet another example of shitting on younger people and disregarding their very valid issues and views.",
            "replies": []
          },
          {
            "body": ">until the older generations naturally become a smaller voting block.\n\nThis will only happen if the current generation of young people actively creates more young people, which they aren't.",
            "replies": []
          },
          {
            "body": "\n\n*I don't see how the lives and opportunities of younger people can meaningfully improve until the older generations naturally become a smaller voting block.*\n\nOr maybe younger voters could actually vote? \n\nThe older you are the more likely you are to vote, if younger demographic groups turned out in the same numbers the problem might not exist. \n\n[2024: Turnout \\~ Age - The British Election Study](https://www.britishelectionstudy.com/graph/?id=38404)",
            "replies": [
              {
                "body": "It's a circular problem - younger groups don't vote because the political parties don't offer policies which would benefit them; the political parties aren't incentivised to create said policies because the younger groups don't vote.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Reading about local objections to the Great Exhibition of 1851. Lovely to know that NIMBYism runs in British blood.",
        "replies": [
          {
            "body": "I know St Chad's Church in Shrewsbury (built 1790) and was pleased to see there was widespread local opposition because its design was thought too modern.\n\nI guess there is a limit to how far you can go back before pre-democratic structures just mean the King or Queen or the Lord or the Church or whatever just built whatever he/she/it wanted.",
            "replies": []
          }
        ]
      },
      {
        "body": "Roll on the trade wars then, right",
        "replies": [
          {
            "body": "🇨🇦: First time?",
            "replies": []
          }
        ]
      },
      {
        "body": "I *think* this thread is the right place for this question? \n\nI've just been reading about an election elsewhere where they ran out of ballot papers and I wondered, would that happen here? At GE, do we print and issue a ballot paper for every single potential voter, or do we assume that many people won't vote and print fewer than that?",
        "replies": [
          {
            "body": "I worked in a polling station once.\n\nWe print enough for every single registered voter (except those who registered for a postal vote), and some spare in case.",
            "replies": [
              {
                "body": "Roughly what percentage of registered voters actually vote?",
                "replies": [
                  {
                    "body": "At the last general election, it was [59.7%](https://commonslibrary.parliament.uk/general-election-2024-turnout/).",
                    "replies": []
                  },
                  {
                    "body": "I did the London Mayoral Election 2021, it was 42.2%",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "body": "Unfortunately it appears he is inactive at the moment but u/JavatheCaveman has worked as a polling clerk and he would have an answer at least as to how many ballots a polling station would have at hand compared to it's electorate. \n\nI'm sure another old Megathreader was also a polling clerk!",
            "replies": [
              {
                "body": "Come back /u/JavatheCaveman, your megathread needs you",
                "replies": [
                  {
                    "body": "He'll probably be back in time for Eurovision.",
                    "replies": []
                  }
                ]
              },
              {
                "body": "Well now you've got me worried about Java - I didn't realise that chat about air fryers was the last time he was here",
                "replies": [
                  {
                    "body": "Presumably, he's deeply traumatised by the switch from Daily to Weekly Megathreads.",
                    "replies": [
                      {
                        "body": "Many of us still live with the deep trauma.  Last week I found myself down by the canal desperate seeking just a taste of M=2.",
                        "replies": []
                      },
                      {
                        "body": "I mean who isn't?",
                        "replies": [
                          {
                            "body": "As much as it pains me to agree with the mods tinkering with things I actually don’t disagree with that decision these days, without the constant Tory psychodrama the megathread was kind of dying on its arse a bit. We get the level of comments in a week that many megathreads would get in a day pre-Starmer sometimes. \n\nI still disagree with the whole ‘the megathread is terrible and everyone should go and argue with the endless bots and bad-faith posters in the main threads instead’ notion some of them have but reducing the rollover frequency wasn’t actually an awful idea in my opinion.",
                            "replies": [
                              {
                                "body": "I think the same. Weekly is fine, but I'll roll my eyes big time if the powers that be try and kill it off again any time soon.",
                                "replies": [
                                  {
                                    "body": "My radical solution is to make everyone active on here a member and set the sub to private when the Yanks are awake.",
                                    "replies": []
                                  }
                                ]
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "body": "Yeah he’s been gone since the start of the year, hope it’s just a case of a New Year’s resolution to avoid reddit or something.",
                    "replies": []
                  },
                  {
                    "body": "Maybe they had a New Year's resolution to spend their life doing more productive things.",
                    "replies": [
                      {
                        "body": "Like using his air fryer?",
                        "replies": []
                      }
                    ]
                  },
                  {
                    "body": "I'm sure (hope?) he is fine, I think he has taken breaks from here before in the past.",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "body": "A question I am qualified to answer as an elections officer. \n\nWe print 100% of ballot papers for all in-person electors at each polling station. By which I mean: total electorate of the polling station - registered postal voters.  \n\nThe only way you could ever run into an issue with this is if the office hadn't cancelled a postal vote from someone who turned up, and the presiding officer was informed that it was a clerical error, and thus told to issue a ballot paper and there was a 100% turnout in the station. Now, this will never happen obviously, and I don't actually know what we'd do in that situation. Probably get a book of papers from another station in that ward, because there's no way everyone has run out. \n\nEdit - on second thoughts, we issue more than 100%, so the entire second paragraph above is completely pointless",
            "replies": []
          }
        ]
      },
      {
        "body": "In the live BBC thread for the trump tariff thing [he also said](https://www.bbc.co.uk/news/live/c1dr7vy39eet?post=asset%3Ad7092ca6-8e8f-45c3-91ea-45ae6cf48382#post)\n\n>\"\\[I'd\\] like to see if we can get that war ended \\[in Ukraine\\], and another war from not starting in the Middle East,\" he said.\n\nOh god, he's going to start a war a war with Iran isn't he?",
        "replies": []
      },
      {
        "body": "41% tariffs on the Falklands. they really are going nuclear",
        "replies": [
          {
            "body": "What's Trump's beef with the Falklands? Did a penguin call him an orange bellend or something?",
            "replies": []
          },
          {
            "body": "Peronist America",
            "replies": []
          }
        ]
      },
      {
        "body": "Something I have not seen mentioned is that the Gilt rate is way down in the last few days, assuming this continues this will help with the fiscal headroom available to the government. Or more likely, help blunt the blow to fiscal headroom that decreased growth will have.",
        "replies": [
          {
            "body": "Swap rates dropping too, which might translate to lower mortgage rates... Could be good news for consumer spending, but only if we avoid a massive recession!",
            "replies": []
          },
          {
            "body": "Really not an insignificant drop, down 0.4% (over 10%).\n\n(Since the spring statement)",
            "replies": [
              {
                "body": "The Telegraph:\n\n*Here's how this is bad for Reeves*",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Gilt yields are crashing this gives Reeves more breathing room with government borrowing interest rates",
        "replies": [
          {
            "body": "With how volatile everything is right now I don't think we can really afford to make long term plans based off current rates tbh. Cheeto Benito is going to throw a lot more tantrums before the year is out.",
            "replies": [
              {
                "body": "It's exactly by why gilt demand is rising and gilt yields are crashing because of Trump, investors are moving their risky assets like stocks to government bonds because they're safer, expect gilt yields to drop even further with global recession.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "The institute for government, in classic ifg fashion, has done a review of reviews to see how we can review better \n\nhttps://www.instituteforgovernment.org.uk/press-release/policy-reviews-valuable-government-sets-success",
        "replies": []
      },
      {
        "body": "it's mother's day, stop arguing about the news and go tell your mum you love her. then you can come back and start arguing about the news again.",
        "replies": [
          {
            "body": "Jokes on you, my mum is working today so my arguing about the news shall be uninterrupted. ",
            "replies": [
              {
                "body": "My mum's dead. I win!",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "The government is now posting on this sub, and someone tried telling me the other day that no one knows we exist! We'll have Liz Kendall arguing with people about her welfare cuts on the megathread by the end of the week.",
        "replies": [
          {
            "body": "Hopefully they do away with computers.",
            "replies": [
              {
                "body": "Yes and Ho!",
                "replies": []
              }
            ]
          },
          {
            "body": "Typical British government, can’t even fed post correctly.",
            "replies": []
          },
          {
            "body": "Honestly, the posts they're making are pretty weak and show a lack of understanding to how Reddit works.\n\nI can't link to it, but one post is just a self-post that starts with \"tldr;\".  It makes absolutely zero sense.\n\nEither a bored intern is running the account, or they've shared the password with all the aged Labour Peers who are frantically trying to figure out what all the acronyms mean.",
            "replies": []
          },
          {
            "body": "What is this referring to?",
            "replies": [
              {
                "body": "A verified government account posted deportation figures.",
                "replies": [
                  {
                    "body": "That’s wild",
                    "replies": []
                  }
                ]
              },
              {
                "body": "u/UKGovNews",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "The tariff calculations appear to not actually be based on any tariffs, \"currency manipulations\", or \"trade barriers\" on the US as advertised, but simply calculated based on trade deficit divided by exports to the US. They haven't actually said this anywhere but if you run the numbers they match up perfectly (see here for one person doing it, you can find loads of versions though everywhere I've run this myself in a spreadsheet [https://x.com/IvanWerning/status/1907562186400002273](https://x.com/IvanWerning/status/1907562186400002273) )\n\n...So the reason why the UK received a 10% tariff is we have a trade deficit with the US of roughly $13 billion (see note) and 10% is the minimum tariff. That's it. This also explains all the absurd tariff rates you see imposed on other countries or territories, including a few where they've just blatantly forgotten obvious things like the fact that the Heard and Mcdonald Islands have no people on them to make the goods that would be charged a 10% tariff.\n\nNote: it's been well reported for a while that both the US and the UK claim a trade surplus with each other because of differences in how they measure trade (see [https://archive.is/XYN2r](https://archive.is/XYN2r) , much of the difference seems to come from the US not grouping crown territories with the UK which include much of our financial services exports). If the US were using the ONS's figures, that is a trade surplus of £71.4b and exports to the US of £186.7b, the calculated \"tariffs on US rate\" would be 38.7%, halved to 19% to give the tariff. About the same as the EU.",
        "replies": [
          {
            "body": "[This might be the first large-scale application of AI technology to geopolitics.. 4o, o3 high, Gemini 2.5 pro, Claude 3.7, Grok all give the same answer to the question on how to impose tariffs easily.](https://x.com/krishnanrohit/status/1907587352157106292)",
            "replies": []
          },
          {
            "body": "Its also interesting that the tariff seem to have been completely unaffected by how nice countries were to trump. The same formula has been used both for places that promised a lot to appease trump and places that took a harder stance. Seems to suggest that its a complete waste of time to offer any compromises to the US.",
            "replies": []
          }
        ]
      },
      {
        "body": "Trump is claiming that the Falkland Islands, a Crown Dependant Territory whose tariff policy is set here in the UK, charge 80% tariffs on America.",
        "replies": [
          {
            "body": "It’s because the formula is literally max(10%, (trade deficit / imports))\n\nThey’re just pretending a trade deficit is a tariff/currency manipulation/unidentified trade barrier \n\nThe funny thing is they actually published this formula, but using Greek math symbols to make it look complicated. But two of the terms in it are 4 and 1/4 and they’re multiplied so they cancel out lol\n\nhttps://x.com/alanmcole/status/1907625370607566862?s=46&t=vm8tXkYETaNcGjHgppANZQ",
            "replies": [
              {
                "body": "I keep mentioning Adam Curtis' film \"Hypernormalisation\" but it goes onto detail about this kind of mathematical approach to real world issues, and it has a lengthy section specifically on Trump. It's on Iplayer.",
                "replies": []
              },
              {
                "body": "The whole idea makes more sense to me if you think about Donald Trump.\n\nDuring the 1980's, people were obsessed with balance of payments and trade deficits. The stock market would eagerly anticipate each new announcement and react accordingly. It extended a bit into the 90s, but today nobody really cares about trade figures and they fell out of fashion.\n\nI think Trump is just reverting to what he knows from the 80s. Trade deficits are bad and we need to reduce them, so apply tariffs.",
                "replies": []
              }
            ]
          },
          {
            "body": "Its not actually based on tariffs but trade balance for some reason which explains why tiny countries seem disproportionately impacted:\n\n\"The specific “reciprocal” tariff rate was roughly half of the current trade imbalance because “the president is lenient and he wants to be kind to the world,” a Trump aide told reporters.\"\n\nhttps://nypost.com/2025/04/02/us-news/trump-slaps-at-least-10-tariffs-on-all-imports-in-declaration-of-economic-independence-half-of-what-they-could-be/",
            "replies": [
              {
                "body": "“For some reason” I saw someone say they asked chat gpt to write a tariff plan based on trade balance and it spat out exactly the plan Trump is enacting. They got it off chat gpt.",
                "replies": []
              }
            ]
          },
          {
            "body": "To be fair those penguins on the Falkland Islands have been ripping off the US for years.",
            "replies": []
          }
        ]
      },
      {
        "body": "Whenever I’m visiting ~~Jacob Rees Mogg’s~~ my mum’s village in Somerset, I like to read the little magazine they have. \n\nToday it had an article about ‘The 10 Laws of Mendip’ which were introduced to deal with lead mining in the 14th Century - \n\n*”If any man of that occupation doth pick or steal any lead or ore to the value of thirteen-pence-halfpenny, the lord or his officer may arrest all his lead works, house and earth, with all his groofs and works, and keep them as safely as to his own use... and shall take that person that hath so offended, and bring him where his house is, or his work, and all his tools or instruments which to the occupation he useth, and put them into the same house, and set fire on all together about him, and banish him from that occupation before the miners for ever.” It has been suggested that any miner who so offended was tied hand and foot and placed in his hut. Bracken and brambles were then piled around it and lit. If he escaped he was allowed to go free, but must leave the Mendips.”*\n\nIn fact, the violence got so bad that the Bishop of Bath and Wells refused to grant licence for any ale houses on the entire Mendip Hills. \n\nBasically, what I’m saying is: close the pubs, burn down offenders’ cottages, and put the bishops back in charge.",
        "replies": [
          {
            "body": "They arrested his groofs?",
            "replies": []
          }
        ]
      },
      {
        "body": "There's an interesting series on Radio 4 this week looking at tax:\n\n  \n[Untaxing with Dan Neidle](https://www.bbc.co.uk/programmes/m0029hd7)\n\nThe first episode was on the Laffer Curve.",
        "replies": [
          {
            "body": "It is utterly amazing how much damage was done by an idiot with a napkin.",
            "replies": [
              {
                "body": "The thing is that the idea of the Laffer curve is obviously correct (tax receipts can be expected to be 0 at 0% tax and at 100% tax, with higher receipts somewhere in between)\n\nHowever, the assumptions that it is a bell curve and that we are on the side of the curve where reducing tax will increase receipts do not follow from the basic idea at all and yet always seem to be taken as just as obviously correct.",
                "replies": [
                  {
                    "body": "This is exactly it. Obviously 0% and 100% are situations with zero tax reciept. Obviously the line in between is a \"curve\" but we have no idea what the shape is, what the optimal value is, whether there are multiple optima... it's just automatically assumed that if we increase tax we'll get less revenue even though that can't possibly be a universal rule.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "Why is the government burning its good will by choosing some of the most unpopular stances towards US tech giants by giving them a tax break?",
        "replies": [
          {
            "body": "I guess the argument is that it’s better than taking the hit from tariffs, supposedly we had 25,000 manufacturing jobs at risk.\n\n\nBut for that argument to work you’d have to presume that Trump negotiates in good faith and sticks to his deals…",
            "replies": [
              {
                "body": "Even before he inevitably welches on the deal, he's trying to impose his ideology on UK companies as a component of the current proposal. I know it's probably the pragmatic thing, to roll over here, but it just feels like we're inviting him to shower us with ever-changing whims. Before you know it, we'll have a Labor Party in government, pandering to our friends across the American Ocean.",
                "replies": []
              }
            ]
          },
          {
            "body": "They probably want those same tech giants to build some data centres here, and they probably want those data centres to part-fund the necessary power upgrades.",
            "replies": []
          },
          {
            "body": "Because the government care much more about the US and American corporations that it does the public. Same as it ever was. \n\nYou might have noticed that a lot of ex-ministers end up working for American companies and NGOs once they’re out of office. Will be interesting to see where the current cadre end up.",
            "replies": []
          }
        ]
      },
      {
        "body": "Surely PMQs today will be dominated by the Nintendo Switch 2?",
        "replies": [
          {
            "body": "'Will the honourable member opposite comment on allegations he mained Meta Knight in Brawl?'",
            "replies": []
          }
        ]
      },
      {
        "body": "A very loose Q, but is the British public really going to accept/welcome the idea of American meat on supermarket shelves? Even if it were to wind up being cheaper than British and Irish produce I still have a hard time believing it'd be remotely popular...",
        "replies": [
          {
            "body": "If you think the farmers went overboard about having to pay their taxes, just imagine what they'd do if they had to compete with substandard but much cheaper meats.",
            "replies": []
          },
          {
            "body": "I think the other responder nailed it: how would you know? I just had a panini for lunch with the missus and it didn’t tell me where the chicken in it came from, how well looked after it was, what the standards in the farm and in the abattoir were and if they had to wash it with Chlorine because they were so worried that poor conditions might cause me to get Salmonella otherwise.  \n\nEven if it was just raw meat on a supermarket shelf there isn’t going to be a massive label on it saying that the cow this burger came from was reared in a shed and given hormone injections to make up for the poor, cramped conditions it lived in all its life.",
            "replies": []
          },
          {
            "body": "The bigger problem will be it being used in pre-prepared stuff, especially large scale catering contracts.",
            "replies": []
          },
          {
            "body": "People have no qualms eating from high street kebab vans.",
            "replies": []
          },
          {
            "body": "I think you’re overestimating how much the average person cares. A lot of people are just on autopilot when they do their weekly shop. The list says chicken, they see chicken on the shelf and pick it up.",
            "replies": []
          },
          {
            "body": "I am also with the people who have answered that a LOT of meat is in food already in some way processed or prepared, so people will not even think about it.\n\nThat is also the downside for the producers- just as we found when leaving the Single Market, the problem is not the nicely presented meat and fish that you see, it is the 'hidden market' of importing or exporting all the other nasty bits.",
            "replies": []
          },
          {
            "body": "I moved to America about 18 months ago and the main meat products are absolutely shite. Loaded with steroids so that the chicken breast is 3x the size. The quality is so bad. Anyone who supports the idea is in for a very rude awakening when they first try it.",
            "replies": []
          },
          {
            "body": "I imagine someone would start a “Buy British” campaign that would shift consumer consciousness up many, many notches. Not sure if origin labelling would catch it and maybe they would lobby to reduce that anyway.\n\nI’m not sure if there’s much they can dump on us that won’t be competing directly with local produce. Maybe some fish?",
            "replies": []
          },
          {
            "body": "Given how much processed food we eat, I sincerely doubt the majority care. Does a single free range fried chicken shop exist? Is it in Islington?",
            "replies": [
              {
                "body": "You won't find it because the vast majority of chicken shops are Halal and Halal free range meat is a niche product.",
                "replies": []
              }
            ]
          },
          {
            "body": "People moan online and then in the shop buy the cheapest option more often than not. People wanting it blocked know that it'll sell well otherwise they wouldn't need to campaign against it.",
            "replies": []
          },
          {
            "body": "I would absolutely accept the idea because it would also mean we had American meat grading on our shelves. \n\nIt's ridiculous that you can put any old shite for sale without any kind of quality grading.",
            "replies": [
              {
                "body": "It says *finest* right on the package. Tesco wouldn't lie to you.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "[https://www.reddit.com/r/ukpolitics/comments/1jqv0na/bbc\\_question\\_time\\_live\\_thread\\_1040pmish\\_bbc1/](https://www.reddit.com/r/ukpolitics/comments/1jqv0na/bbc_question_time_live_thread_1040pmish_bbc1/)\n\n  \nI apologise, complete brain fart from me. Today has been a bit of a tough one and i completely forgot to post the thread",
        "replies": []
      },
      {
        "body": "Just been informed Lee Anderson has been knocking on doors on my street, including a video on Facebook. Reform are gonna push hard for this seat.",
        "replies": [
          {
            "body": "If he knocks on your door please offer him 30p to get a hot meal.",
            "replies": []
          },
          {
            "body": "Don't dox yourself bud!",
            "replies": [
              {
                "body": "Meh, it’s a bunch of houses in a video.",
                "replies": []
              }
            ]
          },
          {
            "body": "Which seat is this?",
            "replies": [
              {
                "body": "I'm guessing the Runcorn and Helsby by-election.",
                "replies": []
              }
            ]
          },
          {
            "body": "Based on the amount of candidates they’re fielding in the locals, they’re more organised than I first thought",
            "replies": []
          },
          {
            "body": "Offer him a succulent 30p meal",
            "replies": []
          }
        ]
      },
      {
        "body": "Went for a haircut before. My barber is a candidate for Reform in the local council elections, previously being an independent councillor at a parish level. I had quite a reasonable conversation with him about it. His personal policy interests are more support for care leavers, more support for people battling alcoholism, and better financial education. We also broadly agreed on plans for changes in the local council with Lancashire County Council set to be abolished in a few years. As far as Reform candidates go he seems the most sane, which is reassuring as I think he has a decent chance of being elected in this ward which is traditionally Tory but has flirted with the Lib Dems. \n\nSo far I've only had leaflets through the door from him, he seems to have started campaigning early, although there was a minor scandal over a campaigning post he put on a local community Facebook group.",
        "replies": [
          {
            "body": "Did he say why Reform and not Lib Dem?\n\nWhilst care leavers are much more prominent in the parties focus the other two are also going to be positions they go for.",
            "replies": [
              {
                "body": "It actually came up in conversation, I think he just finds the Lib Dems a bit wish-washy although he does have good relations with local councillors. Similar to Labour as well, he just finds the other councillors too naive albeit well meaning, and willing to spend on anything.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "I would really love to know the full story about the parents who were arrested for harassing their school. The dad is a Times radio producer with a lot of media connections so is currently getting wall-to-wall favourable coverage. Including an uncritical interview on GMB this morning. But there’s clearly a lot more going on than is being said. The dad has said the ever-incriminating words *”there was just a **bit of banter** on a WhatsApp group”*.",
        "replies": [
          {
            "body": "Could go either way couldn't it. On the one hand, there's a precedent for our police arresting people for online behaviour that doesn't really warrant it. On the other, we hear plenty from teachers about how some parents nowadays have completely lost the plot.",
            "replies": []
          },
          {
            "body": "I'd be incredibly surprised if the parents weren't absolute bastards. I can empathise with them over the difficulties of having a disabled child, and the frustrating nature of working with a beuacraric system, but this much gloss and \"We've done *nothing* wrong\" smells like bullshit. Plus their privileged positions lend them to a bit of hypocrisy.",
            "replies": []
          },
          {
            "body": "There is a lot of \"missing missing reasons\" going on, along with a solid use of the passive voice. Something clearly happened that they're not saying, and they possibly also know ongoing action means others can't say.",
            "replies": []
          },
          {
            "body": "Reading into it, it looks like long-term harassment.  They'd been banned from entering the school grounds previously.",
            "replies": []
          },
          {
            "body": "Whats stopping the school from releasing their side of the story?",
            "replies": [
              {
                "body": "Confidentiality issues surrounding the children I’m guessing. But I don’t know for sure",
                "replies": [
                  {
                    "body": "Two more reasons: Ongoing legal action, in my experience you should always keep your mouth shut.  The messages will get out if they were actually threatening or anything like that and the dad's doing a good job invoking Streisand. \n\nSecond reason, why get in the mud with a pig?",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "The ultimate conspiracy theory is that Liz Truss threw all her weight behind Trump cause she’d found someone who could tank an economy worse than her",
        "replies": [
          {
            "body": "Somewhere, someone in this sub made the joke I wish I’d have thought of…\n\n>Truss wishes she could cause this level of damage",
            "replies": []
          }
        ]
      },
      {
        "body": "Has Gary Stevenson got a PR firm on retainer?",
        "replies": [
          {
            "body": "There's definitely a team of people. He's part of the \"millionaires for humanity\" campaign group too.",
            "replies": []
          },
          {
            "body": "He's got the backing of Novara Media.",
            "replies": []
          },
          {
            "body": "The most disgusting thing is some people do it for free.",
            "replies": [
              {
                "body": "Like, Follow, Subscribe Culture",
                "replies": []
              },
              {
                "body": "Yeah, like those people who go around spreading Rupert Lowe's every waking thought out onto other social media sites.  Just plain weird.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "https://www.independent.co.uk/news/uk/home-news/goats-brean-down-somerset-national-trust-b2724817.html\n\n>Last goats living on UK coastal site culled by National Trust\n\n>>National Trust said it made the ‘difficult decision’ to cull the goats on Brean Down due to tuberculosis (TB)\n\nThe TB-ridden Alpacas weren’t enough to sate his bloodlust any longer",
        "replies": [
          {
            "body": "Starmer angling for the GOAT",
            "replies": []
          },
          {
            "body": "Praise Keir!",
            "replies": []
          },
          {
            "body": "You jest, but goat culling was discussed in Parliament THIS WEEK!\n\nhttps://www.heraldscotland.com/news/25047065.david-mundell-raises-opposition-cull-feral-goat-langholm/",
            "replies": []
          },
          {
            "body": "We tend to visit the beach next door and walk up that hill whenever we visit my sister in Bristol. Had no idea there were even wild goats up there.",
            "replies": []
          }
        ]
      },
      {
        "body": "Happy worst day of the internet year, may all your shared links be triple-checked against multiple sources.",
        "replies": [
          {
            "body": "Already fell for one on a different sub 😢",
            "replies": []
          }
        ]
      },
      {
        "body": "Not politics related, but just a heads up for those who have not seen it elsewhere.\n\nIf you have gaps in your National Insurance record going back more than 6 years, then tomorrow is the last day you can pay to top them up. It could be well worth doing if you are short a few years - you need 35 complete years contributions to qualify for a full pension, and sometimes people only have a few weeks missing from a year. A small outlay now could pay for itself many times over later.\n\nCheck your NI record here to see if you have any gaps: https://www.gov.uk/check-national-insurance-record\n\nAfter tomorrow you can only pay to top up going back 6 years, so it's the last opportunity to do so.\n\nOne option to extend the deadline a bit is if you need to speak to someone about it - it's hard to get through on the phone so you can request a call back from them and as long as you do that before tomorrow you can still pay after the deadline. https://secure.dwp.gov.uk/request-a-call-back-to-pay-voluntary-national-insurance-contributions/contact-form",
        "replies": [
          {
            "body": "Thanks for the heads up, I had a look out of interest. I must admit looking at the £11,502 it mentioned as full state pension, I do slightly wonder if it will still be a thing in the 2050s.....",
            "replies": []
          }
        ]
      },
      {
        "body": "A super fun article from 1999!:\n\n[Blair berates old Labour 'snobs' | Politics | The Guardian](https://www.theguardian.com/politics/1999/jul/07/uk.politicalnews2)\n\nI do feel you could re-write this entire thing and replace Blair with Starmer and no one would be able to tell the difference",
        "replies": []
      },
      {
        "body": "This Trump spokesperson is... something else",
        "replies": [
          {
            "body": "He's been on newsnight quite a few times. Full on true believer in Trump/MAGA rubbish. \n\nOh and he's a Nazi. Deep family links to Nazi organisations in Europe that he is very proud of.",
            "replies": []
          }
        ]
      },
      {
        "body": "Are we still planning to ditch the digital sales tax, or was that just a bargaining chip? Given how tariffs are being calculated (trade deficit of goods only), and that 10% is the floor anyway, I can't see it helping now. It makes sense as a bargaining chip in an eventual free trade deal, though I also don't see any reason to think the US would keep their side of any such deal under the current government.",
        "replies": [
          {
            "body": "An FTA isn't happening (too politically toxic in the UK, unlikely to get votes in the Senate). The provisions would also make dynamic alignment with EU rules impossible.",
            "replies": []
          }
        ]
      },
      {
        "body": "The [Product Regulation and Metrology Bill](https://bills.parliament.uk/bills/3752) defines a pint as equal to 0.56826125 cubic decimetres",
        "replies": []
      },
      {
        "body": "Here's tonight's *Question Time* panel:\n\n> Fiona Bruce presents an hour of debate with politicians, commentators, and members of the public, from Cardiff. On the panel, from the Labour UK government, science and culture minister, Sir Chris Bryant MP; from the Conservatives, the shadow Welsh secretary, Mims Davies MP; Plaid Cymru’s leader, Rhun ap Iorwerth MS; the journalist and commentator Emily Sheffield; and the general secretary of the Wales Trades Union Congress, Shavanah Taj.",
        "replies": [
          {
            "body": "[deleted]",
            "replies": [
              {
                "body": "She also tried and failed to be selected as a Tory candidate last year.",
                "replies": [
                  {
                    "body": "How awful do you have to be where you are unable to get selected as a candidate when your brother in law is the Foreign Secretary.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "A funny April fools joke has never happened. This is doubly true when it comes to politics. The only point of April fools is to drive up ad revenue for sites I have to visit to verify information. It’s all a conspiracy from Big Ad.",
        "replies": [
          {
            "body": "Google releasing Gmail on April Fools day is the closest anyone has got to a good bit.",
            "replies": [
              {
                "body": "The Votann announcement was done well the other year; teased what we thought was a new Space Hulk, then the next day, the trailer continued and unsquatted the Squats.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "We're in full flow for the County Council elections and fucking hell I thought the Greens were NIMBYs but Reform are a whole different breed. What overdevelopment has there been in South Warwickshire?! It's all fucking green belt. \n\nAlso, good luck trying to lower council tax when you can't reduce SEND and social care spending as they're protected.",
        "replies": [
          {
            "body": "Besides the current Labour leadership (thankfully), do we even have a non-nimby party, especially in local elections? Lab, Con, LD, Greens, Reform all run on Nimbyism in local elections, some far more than others of course (I imagine Reform and the Greens being the most Nimby)",
            "replies": []
          }
        ]
      },
      {
        "body": "I live in a \"Red Wall\" town - ex-mining, ex-power generation, ex-factory. (Castleford, W Yorks) Regeneration has been as a dormitory and distribution centre (though we still make Really Useful Boxes) and, as a result, the town centre is a wasteland.\n\nLike /u/SwanBridge I just went for a haircut (daylight robbery, I am so bald it takes only about 150 seconds, making the rate of £7 a tasty rate of £168/hr for the hairdresser) and Mrs tmstms came too to dump some stuff at the charity shop. It is awful how this is a textbook case of a high street beyond saving. There is an extensive urban regeneration project under way, but, like all the previous attempts, it's hard to seeit as anything other than a white elephant.\n\nIt's Mrs tmstms' home town and she said bitterly *It's like a ghost town; I don't know anyone any more*. Sod's Law meant the next minute we bumped into her first cousin, and immediately after, our ex-neighbour.",
        "replies": [
          {
            "body": "Really Useful Boxes might actually be my favorite british product other than Yorkshire Gold tea.\n\nUh, uh, relevance: Yeah nearly every high street has gone one of two ways: American Candy/Vape Shops or abject death. My (temporary) home town of Chatham is of the former variety and I don't think I recommend it.",
            "replies": []
          },
          {
            "body": "Yeah, our high street used to be bustling.  But now it contains 8 charity shops, 4 Turkish Barbers, 3 Thai Nail Salons, and a dozen stores run by bored housewives selling rusty *artisanal* candlesticks and \"retro\" things for £400 a pop, which close within a month of opening.",
            "replies": [
              {
                "body": "We were disturbed to see that a couple of charity shops had actually shut, along with Cooplands (though the latter probably because Greggs has opened, and it would be unpatriotic to oppose the arrival of a Greggs.)",
                "replies": []
              }
            ]
          },
          {
            "body": "I think it's the same with every high street. Ours is 4 Turkish barbers, 2 nail salons, 6 phone/vape shops, 3 charity shops. Has a decent number of cafes and a couple of pubs. There was a lovely cute shop that sold a bunch of homely trinket-y bits and bobs, but it closed down after Christmas. It's sad because my gf and I loved that shop.",
            "replies": [
              {
                "body": "No coincidence that shops that now fill highstreets offer and goods/services/experiences that can't be bought online.",
                "replies": []
              }
            ]
          },
          {
            "body": "I reckon there's at least twice as many retail units in the high street/town centre here as there actually needs to be these days. There are empty units as far as the eye can see, and a lot of them have been empty for a very long time with no real chance of ever being filled again.\n\nOf course some genius decided to add more a couple of years ago and there's more under construction now. Definitely not a massive waste of time and money.",
            "replies": []
          },
          {
            "body": "In my small city the centre of town is always pretty busy, there's a single lane of yes, vape stores and turkish barbers but also indie / smaller  craft, clothing collectable, comic stores that cuts straight through the centre and is the quickest way to go from one side to the other, there's also a mainstreet with the bigger chains + a department store. \n\nThe totally unrelated but the centre is also largely pedestrianise, to get around the centre its a single lane of one way traffic.",
            "replies": []
          }
        ]
      },
      {
        "body": "Thames Water are looking to jump into bed with KKR. It very much feels like no one has learned anything from the last time foreign private equity owned them...",
        "replies": [
          {
            "body": "I presume this is a private equity firm, and not just an IPL cricket team making quite a bizarre investment",
            "replies": []
          }
        ]
      },
      {
        "body": "I guess TFL (finally) banning non-foldable e-bikes is one way to smash the gig economy and illegal workers",
        "replies": []
      },
      {
        "body": "The politics and economics of a good summer is interesting. \n\nProbably not been a ‘good summer’ since 2022. In terms of animal spirits, people feeling good (& likely spending well) could turn some indicators positive for the economy. Could be enough to lead to a more generous OBR report, which as the government are leaving no wiggle room could lead to a very different narrative come Autumn budget. \n\nOn the flip side, if we have a good summer we will almost undoubtedly have record numbers of boat crossings. Politically, this could be dreadful for Labour, on an area where they’re perceived weak at (rightfully or wrongfully). I’m under no doubt Sunak was praying for bad weather, for example (he also had form for some very dubious statements on weather and riding costs of energy).\n\nThere is probably further effects on main policy, nhs demand etc. \n\nIn general, I’m not sure what Labour would prefer.",
        "replies": [
          {
            "body": "Big believer in the Uk national mood being determined by the weather. March has had pretty decent weather this year and everybody just seems so much happier because of it. Spring and summer were (mostly) shite last year and people were far more miserable as a result.",
            "replies": [
              {
                "body": "Agree for sure. \n\nBut this has a very real impact. I suspect many pubs are dependent on a good summer, you only had to look around this weekend to see nearly all pubs full due to the good weather.\n\nFact is we live in a consumption economy, and we consume more when happy.",
                "replies": []
              }
            ]
          },
          {
            "body": "Good summers arent a threshold, they're a goldilocks zone. 2022 was hot enough that imo it got pushed out of being a good summer, I went to both a prodigy indoor gig and a metal outside festival and the heat was def a negative for both",
            "replies": []
          }
        ]
      },
      {
        "body": "[deleted]",
        "replies": [
          {
            "body": "Might be a bit of trade shifted to the UK as well. I recon we got off lightly.",
            "replies": []
          }
        ]
      },
      {
        "body": "Anyone read/reading any good British politics and history books recently?\n\nI'm currently reading Geography Is Destiny: Britain and the World by Ian Morris and it's really good. Talks about how geography has shaped Britain over centuries, both on the world stage but also within the country (such as the dominance of the South East now and historically but why some other regions had more focus in the past etc)",
        "replies": []
      },
      {
        "body": "News Quiz question.\n\nWho said *I am at some disconnect with the world these days* ??\n\na) Donald Trump\n\nb) Prince Harry\n\nc) Ange Postecoglou.",
        "replies": []
      },
      {
        "body": "Can someone explain like I'm 5, the UK 10 year GILT has come down from 4.8% to 4.38%, would Reeves be able to refinance any debt previously issued at the 4.8% level and essentially make a 'gain' on the interest cost difference?",
        "replies": []
      },
      {
        "body": "I will be meeting my MP today in a booked meeting, it doesn't really matter what I wear does it? Can I dress casually",
        "replies": [
          {
            "body": "The important thing is to refer to them throughout the conversation by a revolving list of titles. If you get either the order or titles wrong, they will get offended, stand up and leave.\n\nThe list you need to remember (and the order in which you say them) is:\n\n1. Your Worship (on first introduction, don't use it afterwards and go to 2 when restarting)\n2. My Lord\n3. Your Excellence\n4. Your Honour\n5. Your Grace\n6. Minister\n7. Your Highness\n8. Your Eminence\n\nAs it's Friday, I will give bonus points to those who can correctly identify the person / rank / office to which each actually relates, or provides any others.",
            "replies": [
              {
                "body": "I’ll bite on number three at least. >! Your excellency, an ambassador or Catholic archbishop. Your excellence, God? !<",
                "replies": [
                  {
                    "body": ">!Only Ambassadors. We treat Bishop (Catholic or otherwise) ranks the same as Lords. 'My Lord' for everyone below an Archbishop/Duke. 'Your Grace' for Archbishops/Dukes. !<",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "body": "You can get away without a top-hat and tails, if that's what you mean. As long as you're still in black tie, or an equivalent evening gown if you're a lady. \n\nDon't forget to bow before you speak, too.\n\n[Standards these days, eh...]",
            "replies": []
          },
          {
            "body": "Old potato sack with some rope around the waist.",
            "replies": [
              {
                "body": ">*This season I will mostly be wearing*",
                "replies": []
              },
              {
                "body": "“I did think it’d be polite for me to wear my finest. Yes, that’s right, times are pretty tough for the rest of us at the moment - in case you hadn’t noticed”",
                "replies": []
              },
              {
                "body": "Bread bags for shoes.",
                "replies": []
              }
            ]
          },
          {
            "body": "Do you want a withdrawal of local police support and to have tariffs imposed?  \n\nYou need to wear a suit and say thank you.",
            "replies": []
          },
          {
            "body": "You can dress now you want, but I do think something reasonably smart helps. When I had to dress smart for work I found when I had to interact with others I was generally treated a bit better and taken more seriously. I think a lot of it is due to unconscious bias, but whether we like it or not it exists, might as well try to benefit from it. Your MP should listen to everyone equally, but he might take you more seriously if you're wearing a smart shirt as opposed to a big chungus hoody.",
            "replies": []
          },
          {
            "body": "Oh! I remember this! Where are you meeting?\n\nYou can dress casually, but I would not be scruffy or dirty.",
            "replies": [
              {
                "body": "At his office in town",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Regarding the news about China and their retaliatory tariffs.\n\nWhat could be Trump's plan if countries just start introducing tariffs on US goods at the levels he claimed on his chart that they already had in place?\n\nHe can't really complain if they do what he says they've already done, or he'll be outed as a liar.",
        "replies": [
          {
            "body": "I don't think anyone even in his camp thinks he's not a liar though so not sure how that would matter.",
            "replies": []
          },
          {
            "body": "I think the thing to do would be to introduce them at the levels on the chart -5% and say we've reduced them 5% as a gesture of goodwill.",
            "replies": []
          }
        ]
      },
      {
        "body": "Why are our electricity prices *so* high? I'm familiar with the marginal pricing rule, but why is that a uniquely British issue?",
        "replies": [
          {
            "body": "Our electricity prices are high because: \n\n1. In the 1980s we abandoned plans to replace and modernise our nuclear fleet due to high capital costs while at the same time North Sea gas became more viable for short term energy planning, and despite a brief flirtation with reviving those plans between 2008 and 2015 we've put it off because gas was so cheap.\n\n2. We've put off pumped hydro plans in Scotland and our transmission infrastructure is so old and outdated that we cannot effectively utilise our renewable capacity as there isn't though to efficiently transmit renewable power from (especially in Scotland) wind farms to high-demand areas in the south east of England, making us reliant on needing CCGT as that's the only thing that can quickly come online and scale to meet demand.\n\n3. The Eurasian gas markets are a lot more expensive now than they were a few years ago and we're very exposed to fluctuations in natural gas in that market as the British gas supplies are predominantly traded on that.\n\nSo basically, we're reliant on gas due to decades of can kicking on infrastructure investment for both generation and transmission. We're fixing it now (HPC, SZC, some dormant nuclear plans being lined up in the background, SMR, floating wind and fusion research, battery storage and solar farms in the south east, grid infrastructure upgrades like National Grid's \"Great Grid Upgrade\", new pumped hydro in Scotland) but it takes a while to fix decades of shit planning.",
            "replies": [
              {
                "body": "I think I'd like to add that the UK has effectively no gas storage currently. A lot of European countries will stock up when prices are lower and then mix that in to help keep costs down. Germany has about 3 months worth of natural gas storage and the UK has maybe a couple of weeks at a push so we're completely at the whim of the market whereas Germany can use reserves when gas demand on the market is high.\n\nTransmission infrastructure is probably the biggest reason though. We've gone from the old energy system where energy was produced pretty much everywhere to a significant chunk being produced solely in the North East and Scotland with wind turbines and the grid wasn't designed for up to 60% of the electricity at a time being produced in one area.",
                "replies": [
                  {
                    "body": "Rough is back online now but again that's due to inane short-term cost saving decisions because the government didn't want to subsidise gas storage maintenance due to gas prices being low. I do wonder if anyone in the government was aware of the 1970s energy crisis - the reason France pursued the Messmer Plan.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "Conservative leaflet for local elections is just all about not building things, especially rail (ewr). On the other side is the mayoral candidate advocating construction of a light rail network (which I've no doubt they would oppose in practise)",
        "replies": []
      },
      {
        "body": "There's a piece on the guardian this morning lamenting people who deliberately avoid news without any nuance on why. I suppose it would be too much to ask for a newspaper to point out it's playmates are untrustworthy propaganda sheets.\n\nhttps://www.theguardian.com/media/2025/apr/01/outlets-seek-fresh-strategies-as-uk-poll-shows-news-avoidance-on-the-rise",
        "replies": [
          {
            "body": "I'm not surprised at all in the drop in watching news on TV, that would track with the decline in viewing live TV generally. News website decline is interesting though.\n\nThat said I normally need to go a weekly round up of the news for my wife because she doesn't consume news in any form 😂",
            "replies": []
          },
          {
            "body": "> Newsrooms around the world are deploying “ethics boxes”, story summaries and bite-size explainers to tackle the growing trend of “news avoidance”, as an increase in content and distrust in the media cause more people to tune out.\n\nThis seems like a welcome correction. News peddlers have become obsessed with bloviating their opinions 24/7 on every imaginable platform.\n\nIt's crap. Their content is 99.9% crap. Their creators are 99.9% crap. And now it's finally impacting them in the finances, where it really hurts.\n\nWe need less content and more journalism.",
            "replies": []
          },
          {
            "body": "I think the rise of social media is the key. Not just that people are getting 'news' from it, but just distraction in general. \n\n\nIt used to be that reading the newspaper was the stereotypical thing to do when you were bored at work or had time to kill. Now it's playing on your phone.",
            "replies": []
          }
        ]
      },
      {
        "body": "What if Netflix made a series about axing the triple lock\n\nWould surely be more of a talking point than the other one they're all talking about at the moment",
        "replies": [
          {
            "body": "In a world thats stagnating, a promise made to the old is holding the young back. \n\n[Cuts to a scene of a young, professional but clearly hard done by couple looking wistfully at a semi detached 2 bed and through the window there's a laughing elderly couple having a money fight on their bed made of money]\n\nNow its time to change. To a fairer society. \n\n[Scene of a brave young teenager throwing a molotov at a nursing home, the gold plated curtains inside catch fire]",
            "replies": [
              {
                "body": "People wouldn't sympathise with the young professional couple. \"I did it at their age\". They'd question why they're thinking about houses and not at work producing benefits for pensioners.",
                "replies": []
              }
            ]
          },
          {
            "body": "Or one about the housing crisis.....",
            "replies": [
              {
                "body": "General public shocked at the state of housing and vows to prevent all future construction.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Just sent the MoJ £100 for doing 81 on the M5. Prisons funding crisis averted.",
        "replies": [
          {
            "body": "I actually learnt a couple things when I did a speed awareness course. Most unexpected.\n\nEdit: no i dont remember what they were lmao",
            "replies": [
              {
                "body": "I found it super useful too; I learnt something about presence and distance of streetlamps can inform the speed of a road. Something like if they are both sides equally in line then its 30, and spaced one side then the next side, its 40 and no streetlights maybe NSL/60? I have no doubt I have relayed this incorrectly, I got to do it remotely anyways.\n\nOh the bit that did resonate with me, is 'taking the power back'; don't feel the need to floor it if someones up your arse and to drop to several miles below the speed limit and keep the power in your hands.\n\nI left the speed awareness course more aware of my spirituality than speed, but I haven't been caught for speeding since so it must have done some good.",
                "replies": [
                  {
                    "body": "On the latter paragraph - I think that's just getting old and boring, I did the same.\n\nSome irony in how I had to do my course over Zoom though.",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "body": "Have you considered taking up smoking to help fund the NHS?",
            "replies": []
          },
          {
            "body": "Speeding is cringe.",
            "replies": [
              {
                "body": "Not defending it",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Adolescence is vastly approaching Captain Tom Moore and April 2020 clapping for the NHS levels of pure deranged adulation",
        "replies": [
          {
            "body": "at this point i need to ask who at netflix i pay for a documentry on nationlising the railways, expanding HS2/3/4 and more international trains\n\nseems to be the only way to effect policy at the moment",
            "replies": [
              {
                "body": "For HS3 they could call it 'Trans Pennine' and get some free marketing as the culture war grifters pile on based just on the name.",
                "replies": []
              },
              {
                "body": "Boomers and Bust.\n\nAn acclaimed miniseries documenting the rise and fall of the post war consensus, the insanity around British housing, how wonky our age pyramid is, and why you’re bled white in taxes supporting pensioner-centric largesse you’ll never get to benefit from yourself.",
                "replies": []
              },
              {
                "body": "If it has a ten minute long scene of Stephen Graham sobbing over the Beeching cuts you'll be on to a winner.",
                "replies": []
              }
            ]
          },
          {
            "body": "Perfect storm for the media, we were already going through a Tate Bros inflated moral panic about young boys, who as we all know are going around in armed gangs, when they're not strangling their partners.\n\nThen an easy access drama about it comes along.\n\nPersonally, I can't stand misery-porn films and TV so I try to avoid them like the plague.  Never seen Happy Valley, don't think I ever will.",
            "replies": [
              {
                "body": "Yeah I can’t stand misery porn TV programmes either, they tend to do all your thinking for you. ‘This is horrible and you should believe this about it’ makes for very boring art in my opinion, as opposed to dystopian fiction where the whole point is to make you spontaneously think ‘oh this is like $real_issue’ and trusts the reader to connect the dots themselves.",
                "replies": []
              },
              {
                "body": "My only experience of a Tate bro irl was when a rando at the pub, unprompted, tried to convince me that if I watched Tate i would be able to have relations with my best friends fiance.",
                "replies": []
              },
              {
                "body": ">who as we all know are going around in armed gangs, when they’re not strangling their partners.\n\nI see we’ve moved on from injecting people with drugs.",
                "replies": []
              }
            ]
          },
          {
            "body": "While simultaneously attracting moral panic levels of criticism.\n\n  \nNetflix clearly hired a very good PR agency. I expect there will be awards collected for the \"innovative approach\" to getting coverage of it.",
            "replies": []
          }
        ]
      },
      {
        "body": "I do love when tariffs are on the news, because then I get reminded to look up the bizarre rates of tariffs we place on items from across the world.\n\nWe tariff Bananas from Columbia, but not Ghana, and have a smaller tariff for Mexico as long as they remain under a particular quota. Also for some reason we tariff bananas from Australia, didn't even know they exported bananas. I don't particularly believe our domestic banana industry needs any protection but who am I to know.\n\nA range between 0% to 8% tariffs on Melons.\n\nSpecific carve outs by country on wine imports.\n\nSo strange.",
        "replies": [
          {
            "body": "Could it be that our banana tariffs are leftovers from EU membership? (Spain produces bananas in the Canaries).\n\nWhere there are carve-outs, it definitey has to do with trade deals. I remember a moment when wine from Chile wet low tariff pr tariff-free.",
            "replies": []
          }
        ]
      },
      {
        "body": "Radio 4 quietly getting rid of *A Point of View* is an odd decision. \n\nI heard about the news on *Feedback*, they're apparently replacing it with *Witness History* and extending *Any Questions?*",
        "replies": []
      },
      {
        "body": "Really interesting programme on R4 each Wednesday right now about the influence of free market thinking on the UK:\n\n[https://www.bbc.co.uk/programmes/m00298t1](https://www.bbc.co.uk/programmes/m00298t1)\n\nThe first couple of episodes set the stage for why the UK was open to Thatcher's radical changes to the post-war consensus and where her approach came from ideologically.",
        "replies": []
      },
      {
        "body": "Shame we didn't get 5%, however it looked like we were the joint-least effected.",
        "replies": [
          {
            "body": "He has set a ‘baseline’ tariff of 10% so guess the argument he’d make is it can’t go any lower",
            "replies": [
              {
                "body": "Yeah he didn't want a single digit tariff on his big beautiful tariff board",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Has anyone considered anti-tariffs to combat the tariff menace?",
        "replies": [
          {
            "body": "Bad idea, it turns out they annihilate on contact releasing gamma radiation and political malaise.",
            "replies": []
          },
          {
            "body": "Negative tariffs are sort of a thing, if indirectly, it's basically what \"freeports\" are for. It's how china built up it's technology sector to catch up to the west.",
            "replies": []
          }
        ]
      },
      {
        "body": "[removed]",
        "replies": []
      },
      {
        "body": "[Very much enjoying the website of Nonpol, the first ever \"non-political political party\". Flagship policies include having everything (chemists, doctors, retail) open 24/7 to raise tax income, people who commit antisocial behaviour having a \"higher tax code\" or having their phones taken away and billing China for the cost of COVID.](https://nonpol.com/)",
        "replies": [
          {
            "body": "\"all my beliefs are non political, anyway here is my political party\" - a thing said by people with no ability to introspect whatsoever",
            "replies": [
              {
                "body": "That’s essentially the operating principle of the current government meant as it stands.",
                "replies": []
              }
            ]
          },
          {
            "body": "Love this \"Nonpol - but vaccines are a sham, NATO provoked Russia & woke is destroying our culture. kthxbye\"",
            "replies": []
          },
          {
            "body": "We get leaflets from our local Nonpol candidate, which are somewhat hilarious. For a \"non political\" party they don't half seem to have a lot of political views. \n\nEven his name (Neil O'Neil) makes me laugh for some reason. Day Today vibes.\n\nHis IMDB biography has a ring of that Reform guy that someone posted earlier:\n\n>Starting with the violin in primary school he then moved to bass guitar in secondary school, finally playing for the NWOBHM band Ricochet who have an underground following based on their acclaimed single 'Midas Light'. Neil still plays with Ricochet who are still writing and recording. Having spent a 10 year stint in Germany playing for the Anglo-German rock band Damien who had an Album in the German Rock charts, he finally returned to England to start writing screenplays having complete a 2 year Creative Writing Diploma at the UEA. Neil has had an illustrious career; working in the Bosnian war for the United Nations, the US Department of Defense for NATO in Germany, the Financial Service Industry as a certified Ethical Hacker as well as being an inventor of green technology and internet start-ups. He once took on the Royal Marines through litigation and won, setting a precedent in Internet domain regulations. All this, with a fertile and restless mind, has provided material to numerous unusual and compelling scripts. Neil now lives in the Midlands as a screenwriter and film producer, having numerous awards in both categories.\n\nQuite the interesting life! \n\n  \nHe got 186 votes at the General Election (0.4% of the vote)",
            "replies": []
          },
          {
            "body": "I absolutely love stuff like this. It's a classic very-online idea that \"politics\" is inherently bad so we need to have a party that is apolitical. \n\nBut they completely fail to realise that they are simply painting everything they dislike as \"political\", and everything they like as \"common sense\". It's basically the same as the \"keep politics (I don't agree with) out of my games!\" attitude. \n\nI mean for crying out loud, how can they believe that wokeness or being pro-trans is political, but being anti-woke and anti-trans is non-political?",
            "replies": [
              {
                "body": "Reminds me of the joke about video game characters having two genders, male and political.",
                "replies": []
              },
              {
                "body": "I came across them earlier today as a friend sent me a picture of them campaigning in Stafford, their pop up banner listed \"replace all bad ideas with good ideas\" as one of their ideas.",
                "replies": []
              }
            ]
          },
          {
            "body": ">\"If you run the last election results through an Artificial Intelligence algorithm that maps to Proportional Representation (PR), the results would have been as follows: \"\n\nu wat m8?",
            "replies": [
              {
                "body": "\"I've made some assumptions and put them in a spreadsheet, here is my fantasy results map\".",
                "replies": [
                  {
                    "body": "It's worse than that, they straight up asked AI to give them a PR result.",
                    "replies": [
                      {
                        "body": "Oh god, they have as well. How embarrassing.",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "body": "Far from the first non-political political party.\n\nMy favourite manifestation remains [Make Politicians History/Vote for Yourself Rainbow Dream Ticket](https://en.wikipedia.org/wiki/Make_Politicians_History).",
            "replies": []
          }
        ]
      },
      {
        "body": "It's Nigel Farage's birthday today, according to Politico.\n\nWhat are we giving him?\n\nI've got him a large square faux gold medallion with a broad red ribbon. It has 'REFORM FIXED IT FOR ME' written on it. My wife has got him a red tracksuit.\n\nEdit: at times like this, I wish I had the superpower to see deleted replies. I bet there were some corkers in there.",
        "replies": []
      },
      {
        "body": "[removed]",
        "replies": []
      },
      {
        "body": "There's a fascinating interview with Lord Leveson on this weeks Law and Disorder podcast",
        "replies": []
      },
      {
        "body": "Can't say they aren't doing summit.",
        "replies": []
      },
      {
        "body": "Good article on the Barclay brothers in the LRB\n\nhttps://www.lrb.co.uk/the-paper/v47/n06/daniel-cohen/kippers-and-champagne",
        "replies": [
          {
            "body": "[Archive link](https://archive.is/20250327110439/https://www.lrb.co.uk/the-paper/v47/n06/daniel-cohen/kippers-and-champagne) for those of us not wanting to subscribe to read.",
            "replies": [
              {
                "body": "mea culpa, uBlock origin still works (for now) on Chrome",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Excited / scared for 8am when the UK stock market opens, futures point to a 1.8% decline at time of writing but it feels like it could be so much worse as Starmer and other EU leaders will undoubtedly make statements throughout the day, buckle up folks...",
        "replies": [
          {
            "body": "FUCK. He tanked Games Workshop stock by 2%.",
            "replies": []
          }
        ]
      },
      {
        "body": "I'm not sure I really believe we are going into a recession yet 🤢 it's just sinking in, sucks for us, sucks for Labour.\n\nAll the prior debate and effort around the govs actions to grow the economy seem quaint and pointless in the face of what's coming",
        "replies": [
          {
            "body": "Weve been in a per capita recession for 5 years",
            "replies": [
              {
                "body": "Or a per capita stagnation for around 17 years.  I suspect the impact of these tariffs will be quite small to the ordinary person.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Neil O'Neil is the NonPol party, he won a few hundred votes in Stratford. He's also a screenwriter.\n\nhttps://x.com/tontytrains/status/1907056698902114672  \nhttps://x.com/stokaljona/status/1907166519726854247  \n\nThese tweets have photos of their banner and parts of their campaign leaflet. Obviously, his idea of non-political is crazy. But for a screenwriter, I'm surprised how poorly written this is. It has a mix of pronouns, little attempt to be compelling, randomly bringing in Andrew Bridgen as an expert, mixed references to Putin and Russia. And what's up with bridge congestion?",
        "replies": [
          {
            "body": "Policy 7 is genius, I can't believe nobody has tried \"replace bad ideas with good ideas\" before",
            "replies": [
              {
                "body": "I believe in things that work. My opponents believe in things that don’t. You can trust me on this.",
                "replies": []
              },
              {
                "body": "Turns out the public really likes bad ideas.",
                "replies": []
              }
            ]
          },
          {
            "body": "Bit worrying that he's got \"good ideas from across the spectrum\", and then specifically cites the spectrum as including both the communists and the fascists.\n\nWhat good ideas did they have?  \n\nI *suppose* you could grant that the fascists at least had the right idea when they got Hugo Boss to design their uniforms, but I'm not sure that's *much* of a basis for policy.",
            "replies": [
              {
                "body": "Soviet Union: Epic National Anthem",
                "replies": []
              },
              {
                "body": "His policies are fascist but you can tell his logo is communist because it’s black and white, just like every photo of Karl Marx.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "If oil prices continue to decline, headline inflation is going to peak a lot, lot lower then predicted by the OBR (we shouldn’t decide monetary policy by this, but I’m not convinced we won’t).",
        "replies": [
          {
            "body": "Starmer's monkey paw has been suspiciously absent lately so this impact is not unexpected. Now just to see if the other side of lower inflation is a full-blown recession",
            "replies": []
          }
        ]
      },
      {
        "body": "Mods, are there plans to do local election previews again?",
        "replies": []
      },
      {
        "body": "Recently many on the left, including Clive Lewis, Diane Abbott, and non elected people like Gary Stevenson have argued in favour of an annual wealth tax of 2% on net assets over 10m.\n\nThey are all extrapolating from the report A wealth tax for the UK, by the Wealth Tax Commission.\n\nThat report, which examines both a one off and annual wealth tax specifically says that it doesn’t think an annual wealth tax is workable, the continuing cost of valuing assets, most specifically privately owned businesses , as well as behavioural changes would mean that it’s a really hard to implement tax.\n\nAnd that is on top of the fact that this tax is levied on just 22k people, meaning that small changes in migration patterns can vastly change how much you get.\n\nAnd the fact that the report only examines a tax rate up to 1% on assets over 10m not 2%, and the behavioural impact of the 2% tax is not well studied as there is too little evidence",
        "replies": [
          {
            "body": "Where did Gary Stevenson come from and why am I hearing about him constantly from seemingly out of nowhere?",
            "replies": [
              {
                "body": "He's been publishing videos as Garys Economics on Youtube to a small but growing audience for years, it's the usual overnight success story. He has a video from last February when he hit 100k subscribers, and is at over a million now.",
                "replies": []
              },
              {
                "body": "Former city trader who then got an MPhil in Economics from Oxford who is the latest in a long line of left pop economists who claim they've managed to understand something about the economic system that other economists can't see or even don't want us to see. Made a big name for himself on youtube doing it.\n\nMakes a lot of misleading claims that are disputed by former colleagues and others in his field, both about his trading career, as well as about economics. Does seem to be good at promoting himself though.",
                "replies": []
              },
              {
                "body": "It looks like he's managed to crack the YouTube algorithm based on [these stats](https://socialblade.com/youtube/channel/UC5Ghe5TBQGYIOANuiNW4hDQ).",
                "replies": []
              },
              {
                "body": "Maybe we can chuck him and Adolescence in Room 101....",
                "replies": []
              }
            ]
          },
          {
            "body": "Tax the rich and zero immigration are just the unfeasible panaceas balanced on either tip of the populist horseshoe. People don't want to hear that complicated problems need complicated solutions.",
            "replies": []
          },
          {
            "body": "The problem with taxing the uber rich is that they are always going to have better accountants and lawyers than the government.\n\nThe only way you can do it is indirectly - increasing duty on the things they buy, closing loopholes they use etc.",
            "replies": []
          },
          {
            "body": ">would mean that it’s a really hard to implement tax.\n\nThis section seems to be missed by many. \n\nIt's not just \"hard\" it's an expensive tax in that it's expensive to administer and enforce.\n\nI don't want the government to waste my tax chasing tax that will never be received.\n\nThere's plenty of other options.\n\nEven if you are going to target the wealthy you can do it at point of interactions which is easier.\n\nA tax on the sale of any shares worth in total over £1m would be better than this idea.",
            "replies": []
          }
        ]
      },
      {
        "body": "https://www.glassdoor.co.uk/job-listing/devops-engineer-avantao-technologies-pvt-ltd-JV_IC3380743_KO0,15_KE16,44.htm?jl=1009683576043\n\nUh oh. Job posting accidentally including \"Only candidates who are immigrants from India will be considered.\" Obviously illegal, but enforcement of this stuff is so weak in UK they'll probably just get a slap on the wrist.\n\nWonder how common this is in UK. Seems to be a thing in US that was discussed heavily during their recent election among tech workers but didn't seem to make it across the pond.",
        "replies": [
          {
            "body": "The sort of salary I'd have turned down in the mid 90s.\n\nAre permie IT salaries really this bad?",
            "replies": [
              {
                "body": "Not in my experience, IT salaries are quite stagnant at the moment but you'd struggle to get someone good for this. They're only getting away with it by hiring people looking for a move to the UK.\n\n\nThis, combined with the advert wording should be grounds for immediately revoking their sponsorship licence. ",
                "replies": [
                  {
                    "body": "Not just that ... criminal charges for the directors and owners.",
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "body": "I'm guessing it's not normal for all their application questions to be about getting a visa too. Seems weirdly blatant",
            "replies": []
          },
          {
            "body": "Data scientist or £35k salary, you can only pick one of those.",
            "replies": []
          },
          {
            "body": "Indians hiring Indians in tech role, its so common it doesn't even raise eyebrows anymore lol",
            "replies": [
              {
                "body": "Yeah, this was the common story recounting by Americans when I saw it, back in Autumn last year. This was from really not right-leaning accounts either. \n\nStandard story would be that they would hire a genuinely good Indian candidate into a role, they would perform well, be put on a 3-person hiring panel, if there was a split decision to hire a new candidate between Indian and non-Indian it was a toss up, but if you end up with 2/3 of the hiring panel being Indian then within a year all new hires would be Indian, the non-Indians would leave the team and then the entire team is Indian.\n\nThey all said there was a critical mass effect where it becomes unstoppable.",
                "replies": []
              }
            ]
          },
          {
            "body": "Company looks as sketchy as all heck.  Their website is very barebones on the details of what they actually do, with the exception of the visa sponsorship page, and social medias are all over the map.\n\nCould be a visa farm.\n\nEdit: Also, that wage is dreadful for the requirements they're asking for.  Full-stack developer for only £35-40k??!  Are you fecking kiddin' me?  Another sign that they don't want non-sponsored candidates.",
            "replies": [
              {
                "body": "One of the bullet points on their sponsorship page is \"Better Jobs\" \"Find good jobs in the UK and grow in your career.\" That's a bizarre thing to say if you're sponsoring a visa so they can work for you. Another is \"Fly to the UK\" \"Once you get the visa, you're ready to go the UK and start your job.\" which doesn't sound much like they expect you to be working with them. It sounds a lot like a visa farm IMO.",
                "replies": []
              }
            ]
          },
          {
            "body": "Going to assume they are recouping the costs of the visa and likely skimming some off the top from people applying. Or that and deliberately hiring people on sponsor visas as they can overwork them on threat of getting rid of them and them losing their visa.\n\n\nMost above board companies would rather avoid sponsorship unless really necessary, it's expensive at scale, takes forever and adds a lot of admin for everyone involved.",
            "replies": []
          }
        ]
      },
      {
        "body": ">RETURNED: More than 24,000 people who have no legal right to be in the UK, including 3,594 foreign national offenders.\n \n>This is the highest returns rate for eight years and the four biggest return flights ever.\n\n>Our Plan for Change is securing our borders.\n\n>https://x.com/10DowningStreet/status/1906626248492618214",
        "replies": [
          {
            "body": "The instagram comments are calling them fascists...for following the laws we've had for decades.",
            "replies": []
          },
          {
            "body": "Not one for the migrant hysteria but that’s actually a very substantial number given the rate of irregular arrivals is [<40,000](https://www.gov.uk/government/statistics/irregular-migration-to-the-uk-year-ending-march-2024/irregular-migration-to-the-uk-year-ending-march-2024) a year.",
            "replies": [
              {
                "body": ">Not one for the migrant hysteria\n\nI know what you mean but the more they publicise what they're doing here the better.\n\nThe more the public have an impression that something's being done the less likely people are to vote for snake oil salesmen.",
                "replies": [
                  {
                    "body": "Not just the public's impression, but that of would-be migrants. \n\nIf anything, the tabloids going on and on about how easy it is to enter the country has made more people likely to chance their arm to enter the country.",
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "body": "Time to call your mum, gents.\n\n\n\n^Or ^I ^can ^call ^her ^for ^you ^*hiyooooooo*",
        "replies": [
          {
            "body": "Well I tried to borrow the Ukpol ouija board but Roguepope's still busy asking music hall comics for more puns.",
            "replies": [
              {
                "body": "Oh your mother was mostly spirits long before she died.",
                "replies": [
                  {
                    "body": "Oh he's such a *card*",
                    "replies": []
                  }
                ]
              },
              {
                "body": "Yeah that’s what I was thinking \n\nI spent 6 moths watching her being slowly killed by the local district hospital last year….a line to the other side would be nice but I suspect she’ll be rather angry",
                "replies": []
              }
            ]
          },
          {
            "body": "I've never called my mum gents and I'm not going to start calling her it now.",
            "replies": [
              {
                "body": "I regularly meet your mum in the gents, but then she's always in there, tbf.",
                "replies": []
              }
            ]
          },
          {
            "body": "You'd just try to reverse the call charges you cheapskate.",
            "replies": []
          },
          {
            "body": "[deleted]",
            "replies": [
              {
                "body": "Has Trump not signed an executive order making us all on their schedule yet?",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "At least tomorrow we may see an end to the incessant fantastical takes about some magical exemption from US tariffs. ",
        "replies": []
      },
      {
        "body": "Big thumbs up for BST coming in at the weekend.  Gave me an extra hour to recalculate all our US landed costs, recalculate the retail prices and put them live across all our US sales sites, all before they've even woken up.",
        "replies": []
      },
      {
        "body": "Ahh you can tell it's the new financial year because we're in those few weeks where you actually see police cars driving around.",
        "replies": []
      },
      {
        "body": "One idea regarding cutting the social care bill and  freeing up housing which doesn't seem to be pushed heavily? Promote living together again. \n\n\nWe've hordes of pensioners living on their own in three-four bedroom homes who need regular check ins from the council after a single fall, when they've perfectly capable kids who can pick up the slack somewhat. Now I'm not talking about the full on medical nursing element, just the basic care, but it seems mad to me we've no one promoting \"Bring the family home\" or something. ",
        "replies": [
          {
            "body": "I'm not sure \"we've screwed your generation over in every way, and now we want to make you take your parents in too\" will *necessarily* go down particularly well...",
            "replies": [
              {
                "body": "\"We fucked you for so long, we could promote mobile by removing stamp duty, but instead you should live with your parents in their 2 bed semi - your nan is moving in too.\n\nDon't be angry I'm literally allergic to building houses or sensible economic policy around house sales\"\n\nWhat you mean, Lycan? Sounds like a winner to me...",
                "replies": []
              }
            ]
          },
          {
            "body": "Good luck with that mate, you've got people living with their parents until they're in their 30s, even 40s. If they managed to get out then they'll be staying with their parents again after a few decades if we went back to a family home.",
            "replies": []
          },
          {
            "body": "Isn’t this literally the bedroom tax that tanked Theresa May?",
            "replies": [
              {
                "body": "Are you thinking of the dementia tax? The bedroom tax was introduced by Cameron during the coalition, and he won the following election.",
                "replies": []
              }
            ]
          },
          {
            "body": "I want housing so I don't have to do this.",
            "replies": []
          }
        ]
      },
      {
        "body": "Reform have named their Cambridgeshire and Peterborough mayoral candidate - Ryan Coogan... I've been enjoying reading his website ryancoogan.co.uk and now you can too. He's certainly achieved a lot! And he wants to introduce a DOGE to East Anglian local government!",
        "replies": [
          {
            "body": "He seemingly solved MRSA _and_ managed a Sainsburys. What a guy.\n\n\nAlso never expected to see a Reform candidate touting their achievements in diversity.",
            "replies": []
          },
          {
            "body": "I don't mean this to mock the man but his photos were really bothering me and I couldn't figure out why. Turns out it's because every photo makes him look like he has no teeth. Go onto his website and scroll to the bottom to see what I mean",
            "replies": []
          }
        ]
      },
      {
        "body": "10% tariffs from US apparently. So could be worse but not good",
        "replies": []
      },
      {
        "body": "‘We are giving discounts’ yet UK get the baseline 10% match.",
        "replies": [
          {
            "body": "Our tariffs are only 0.5% higher on average than the US as well",
            "replies": []
          }
        ]
      },
      {
        "body": "Might aswell double the tariff if the US cuts it in half",
        "replies": []
      },
      {
        "body": "In the past I’ve advodacted for some sort of uk strategy to reenvigorate our high tech manufactutiring sector. To be clear Trump’s approach is ass backwards. You need to stoke the embers first before shutting everything else out",
        "replies": []
      },
      {
        "body": "Right, I think I've done every SOPN out which is probably about 20-30%.\n\nSo in summary (and I'll say the ones out may not be representative of everywhere up) Lib, Lab, Con and Ref are basically standing everywhere (except the Lib Dems having a few issues in Nottinghamshire) with the Grns in most places (but missing notably more than the other 4). There is the usual scattering of independents, far right and splitter left with nothing much of note other than Hertfordshire seemingly being a hotbed of socialists with nearly full slates of TUSC in those councils out.",
        "replies": []
      },
      {
        "body": "It's been four months since the last Senedd voting intention poll.\n\nI'm starving out here.",
        "replies": []
      },
      {
        "body": "I read a headline saying that Australia's pensions system is one of the best in the world. What do they do over there and could we do it here?",
        "replies": [
          {
            "body": "The average age in Australia is below the OECD average, and relatively high levels of youth immigration are slowing its upward trend. The overall burden is much less as a result. \n\nAlthough they have a universal pension, it is less generous than here, roughly £8k per year although it can be extended further through means testing, similar to our pension credit. \n\nEmployer contributions to workplace pensions are compulsory and are much higher, I think it is 11.5% now compared to a mere 3% in the UK. \n\nI think there is also a bigger culture around personal savings and private pensions as well with the RSA which is similar to our LISA but with much higher take-up. \n\nTL:DR - Younger population, less generous state pension, higher employer contributions, and a more savings orientated culture. Politically none of that is achievable in the short to medium term over here, but there are definite lessons we can learn.",
            "replies": []
          }
        ]
      },
      {
        "body": "[removed]",
        "replies": []
      },
      {
        "body": "Are U.K. imports likely to get cheaper due to the US tariffs? Won’t some of this companies be massively overstocked in the country of manufacture and divert the stock to non US countries to avoid tariffs?",
        "replies": [
          {
            "body": "Maybe on that front, but in answer to...\n\n> Are U.K. imports likely to get cheaper due to the US tariffs? \n\nIt seems at least yes for a different reason.\n\nhttps://www.reddit.com/r/ukpolitics/comments/1jr9gwg/vanguard_sees_pound_at_140_as_uk_more_insulated/\n\nWe're a net importer, which means stronger pound means we get more for our money. If investors are reassured about our currency / economy / government, and see us as a safer bet, demand for the pound rises. Imports get cheaper. It's amazing how quickly things change, remember the run on the pound when Truss was PM? https://www.bbc.co.uk/news/business-63326809\n\n> The pound rose against the dollar and government borrowing costs dipped as the markets reacted to Prime Minister Liz Truss's resignation.\n> \n> Sterling hit $1.13 as Ms Truss made her announcement and rose higher in the afternoon before falling back to $1.12.\n\nversus:\n\n> US tariffs will only have a “very marginal” impact on UK economic growth, according to Ales Koutny, the firm’s head of international rates. That prospect and signs of stability in the gilt market are attracting investors, making $1.40 a “very achievable target by the end of the year,” he said in an interview.\n\n> It’s a level that the pound has only breached briefly since the UK’s 2016 referendum to leave the European Union sent the exchange rate sharply lower.\n\nConversely, though, it does harm exports as our products get comparatively more expensive too, but if we buy more than we sell, net gain. Countries with the opposite set up can benefit from the other, like during the Eurozone crisis there was a lot of talk that the Euro made it more expensive for Greece to import, where as, Greece being in the Euro sandbagged the currency which benefitted German exports so they made fortunes from the weaker currency.",
            "replies": []
          }
        ]
      },
      {
        "body": "Are we in the death by a thousand cuts phase of job cuts? \n\nSeems various orgs and public bodies are reducing headcount not by significant amounts but enough to make the job situation dicey come autumn time. And it seems the jobs that are going are the bottom end jobs, meaning the entry level job market is getting most of the squeeze.",
        "replies": [
          {
            "body": "It's funny. Our local NHS trust has a job freeze again for non clinical staff but has managed to recruit 10-12 new directors and deputy directors. Can't get ward clerks or receptionists or secretaries but can get a dozen people on 10 times the wage.",
            "replies": [
              {
                "body": "NHS suffers from budget pot syndrome. You will probably find that those directors and deputy directors are needed, and have probably been needed for years it’s just they got the budget for them ready now. \nConversely the budgets for the needed clerks won’t be ready for years. \nSo everything becomes off cycle. The directors, will be coming in to teams that have probably changed scope since their roles were spec’d. And the wards will have lost institutional knowledge by the time they hire the new clerks",
                "replies": [
                  {
                    "body": "There are some people who point blank refuse to believe there is any waste or over management in the NHS",
                    "replies": [
                      {
                        "body": "And it's often non medics, or non-doctors who've never held senior posts. Both my parents are retired consultants and one was a divisional medical director - most senior medics recognise the NHS has become under managed during their careers rather than over across the spectrum, especially on the world stage relative to any other health system where the NHS ranks as having the lowest managers per capita. Under managed both in terms of headcount and talent - which are both factors. Not attracting good mgmt talent and having not enough of them exacerbates the problem.\n\nBy the time my dad and many of his colleagues retired they were spending 1 day a week in the operating theatre of effectively a 6 day a week job - a drastic change from the generation prior and the alarming scope creep of senior doctors having to do way more admin and management tasks with the drop in headcount of managers - which takes away from patient time.",
                        "replies": []
                      },
                      {
                        "body": "There is waste but it’s structural, the waste in the NHS is mostly due to how they go about things. But that’s because of the management culture we have developed in this country.\n\n\nWe have a culture of managers that just say yes to whatever top down directive because they have no incentives to push back, even when they know the directive has long term negative consequences. And because we never let things fail, the people at the top keep on thinking their directive are correct.",
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "body": "It's such a tough balancing act, and I do not envy Reeves in the slightest. \n\nUltimately job losses and the economy cooling down are the expected result of our monetary policy in higher **interest** rates which help to fight inflation. On a macro scale this isn't necessarily a bad thing, some jobs and some businesses aren't productive and the long period of low interest rates following the Great Recession zombified a lot of the economy. To use a metaphor it's like cutting off some dead branches to bring a tree back to health again. That isn't to say I don't recognise that for those affected by it that it is a miserable situation to be in, just that on a macro scale it is higher interest rates doing what they're intended to do. \n\nHowever recent changes to employer national insurance rates and policy around thresholds are further compounding this misery, at a time when inflation is stubbornly falling, but growth is stagnant. We're teetering very close to stagflation, and arguably even in that zone if we remove immigration from the equation and look at growth on a per capita basis. However at the same time we have very little fiscal flexibility, when we desperately need it to re-arm our military, re-build our infrastructure, and fix our broken services. Fighting both inflation and recession simultaneously is extremely difficult, and it appears that growth has been put on the alter for the time being, which is the correct choice according to conventional wisdom. \n\nWe had 14 years of the Tories rearranging the deckchairs on a sinking ship, and it appears we now have at least another four years of Labour attempting the same. I get the government are being cautious and their options are limited, but the need to start looking at different approaches to bring back real growth, otherwise we're at risk of another decade of decline. The longer this continues the harder it'll be to pull ourselves out of it. There are some parts of Labour's policy that gives me hope, but how it eventually plays out is anyone's guess.",
            "replies": []
          }
        ]
      },
      {
        "body": "Is Britain ready for a stronger Sterling? We’ve relied on a weaker sterling to make exports work but if sterling becomes the safe port in this storm, can we do anything?",
        "replies": [
          {
            "body": "The UK would most likely benefit from a stronger currency. \n\nOur exports are generally inelastic (hence why we’ve not gained that much from it being devalued). Commodities becoming cheaper would be helpful for consumers.",
            "replies": []
          }
        ]
      },
      {
        "body": "I'm worried a domino effect might 'win' Trump the trade war. If country A and B both produce a product to sell to the US, and both have the same tariffs in place, but country A decides to 'do a deal' with the US, then they'll end up being able to ship an increased quantity of goods to fill the void left by both countries, leading to country B sweating and sprinting for their own deal. If country B had another product similar to country C then, well, you get the idea.\n\nHow many countries would it really take before the rest fall in line? Vietnam has already said they've made concessions and are in negotiations for a 0% tariff.",
        "replies": [
          {
            "body": "> How many countries would it really take before the rest fall in line?\n\nThere are established blocks that are large enough that on their own they could push back against the US' tariffs. During Trump's first term he had a similar trade war with China and china consistently maintained higher tariffs than the US even as Trump repeatedly raised them.\n\nTrump already folded on semiconductors, for example, because the reality is the US isn't ready for autarky and there are clearly many other areas where the US can be pinched. The converse of what you've said is also true - if the US starts to waver or capitulate then that will change the way that other countries deal with them. If the internal systems of the US stop the tariffs from having their full effect then other countries will become more resolute.\n\n&nbsp;\n\nI suspect that either way the answer will be decisive, but I also think that trump has a much stronger stomach for these sorts of shocks than his voters, the republican party or the rest of his government. The ground could very easily fall out from under him.",
            "replies": []
          }
        ]
      },
      {
        "body": "On LBC this morning Nick Ferrari was criticising Kemi Badenoch for not having watched Adolescence. \n\nWhen was the last time a *fictional* drama has such an impact on the public consciousness? \n\nI can't help but think yet another thing telling young boys that there is something wrong with them is just going to push some people further down the rabbit hole.",
        "replies": [
          {
            "body": "I just find it immensely depressing that nobody gave a shit about this until a TV programme marketed itself really well.\n\nAnd just like the Horizon dramatisation, everyone will move on in a bit and forget to pretend like they care.\n\nIt's all very unserious and completely on-brand for the UK. Mass political participation through watching television and doing nothing.",
            "replies": []
          },
          {
            "body": "> yet another thing telling young boys that there is something wrong with them\n\nI interpreted it the opposite way, that there wasn't anything inherently \"wrong\" with Jamie and that he was instead the product of his environment. The message I took from it is that we need to let young boys be themselves more, and not pressure them into being stereotypically masculine and grown up (e.g the dad pushing him sports he wasn't interested in, or his classmates/social media making him feel he should be sexually active already).\n\nThe show was far more critical of our schools, the manosphere infuencers, bullyung etc than it was about \"young boys\".",
            "replies": []
          },
          {
            "body": "Threads, perhaps? It certainly sharpened minds regarding the threat of nuclear weapons.",
            "replies": []
          },
          {
            "body": "I haven't seen the show and I'm sure it is a very good TV show. But, it is fictional. It's not based on actual events. I don't think politicians have to watch this TV show or that documentary to be informed about a topic. There are numerous other ways to be informed about topics and issues affecting society.",
            "replies": []
          },
          {
            "body": ">When was the last time a *fictional* drama has such an impact on the public consciousness? \n\nThreads or Cathy Come Home probably. \n\nI have no problem with people being moved to action by a fictional drama (especially given it is pretty closely based on some real cases). That's what good art can do. \n\nMy only problem is that the act of watching a drama, and making kids watch it, doesn't do anything to solve the root causes by itself. But if it encourages government to look at why these things happen, and if it makes parents take more interest in what their kids are doing online, that's not a bad thing.",
            "replies": []
          },
          {
            "body": "Off the top of my head, it's *Mr Bates v The Post Office* so pretty recent.",
            "replies": [
              {
                "body": "At least that's based on a true story.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "One of David Cameron's favourite world topics to talk about ever since becoming PM back in 2010 was weirdly Chagos. It seemed odd, then that he would decline to comment on the deal he crafted, when it's in the news more than ever. Right?\n\nOne of Badenoch and Jenrick's big claims is that \"Cameron halted the deal\" because of sovereignty. British Journalists have even repeated this claim, repeatedly saying Cameron halted the deal in December 2023.\n\nHere's Sky News Politcal Reporter Alix Culbertson repeating the claim:\n\n>[In December 2023, when David Cameron was foreign secretary, the talks were discontinued after a paper by three legal academics said transferring the islands would be a \"major self-inflected blow\" for the UK.](https://news.sky.com/story/uk-to-hand-over-sovereignty-of-chagos-islands-to-mauritius-after-decades-long-dispute-13227089)\n\n...Except that's not true. Cameron gave oral evidence at the Foreign Affairs Select committee in Jan 2024 confirming that negotiations were ongoing:\n\n>[When I was Prime Minister, it was all about trying to see if we could relocate Chagossians back on to the\nouter islands; lots of work was done, and it was not possible. It is exactly what I am asking. **As I say, there is a negotiation ongoing.** The absolutely crucial thing is the safety, security and long-term viability of this base in a difficult and dangerous world.](https://committees.parliament.uk/oralevidence/14047/pdf/)\n\nSo I do a time sensitive google of news stories, pre GE about Cameron \"halting the deal\". **You get nothing. Zero** \n\nIt's a lie made up after the fact by the Conservative party after losing the GE. If you think about it for a moment, after all it makes no logical sense for Cameron to renegade on a deal over sovereignty - when the entire premise of the deal he was negotiating was about handing over the islands to Mauritius and keeping the US base under lease. It would be like walking into a steakhouse for dinner by your own choice, and being outraged suddenly there's only steaks on the menu. Cameron patently still supports the deal, which is why he hasn't commented on it - out of courtesy for the Conservative party.\n\nThe wider point is. How bloody shocking is British Journalism? Do journalists verify anything anymore rather than repeat verbatim what they're told by political contacts?\n\n[I've been banging on for a while about how shocking and naive British Journo coverage of Chagos has been for months](https://old.reddit.com/r/ukpolitics/comments/1hzg94l/weekly_rumours_speculation_questions_and_reaction/m7a0pr1/?context=3), particularly assumptions around USA positions on it based seemingly of random vibes from Farage about what the Trump camp must think (so of course British Journalists think it must be true)\n\nIt's pathetic how little intellectual curiosity British Journalists have left in this country.",
        "replies": []
      },
      {
        "body": "Labour should just get rid of the Sentencing Council. It's only existed for 15 years and is coming out with some insane takes.",
        "replies": [
          {
            "body": "From the sounds of it they're going to override this specific guidance that's been problematic but not rush further reforms which will come with a sentencing bill that follows David Gaukes review (something I'm very optimistic about but will probably be a political shitshow as what is needed would be a challenge for even the likes of Alastair Campbell to communicate well and Labour are nowhere near that). This is quite a sensible approach so as to actually improve the system rather than just need to go back and have another look in a couple of years time.",
            "replies": []
          },
          {
            "body": "Continual outsourcing of political decisions to not particularly accountable bodies is ridiculous.",
            "replies": [
              {
                "body": "The creation of the sentencing council was not an example of the outsourcing of political decisions.\n\nPrior to its formation, judges didn't use sentencing guidelines given to them by politicians (aside from what sentencing ranges were laid down in legislation for each offence) - from around the 1980s they used court of appeal judgements as guidance and prior to that there was not really any guidance, with individual judges basing their approach on whatever previous cases they were aware of.\n\nThe idea of the Sentencing Advisory Panel (which went on to become the Sentencing Guidelines Council and then the Sentencing Council) was to get more consistency in sentencing by providing national guidelines but the less formal guidance it replaced was always from within the judiciary, rather than handed to it by politicians.\n\nIf the politicians want specific things to be considered or not considered during sentencing, they should legislate for that, not hand the government of the day direct influence over how the judiciary does its job.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "Not sure if Intpol but I'm thinking in more of a domestic way so I'll put it here. Since Trump has caused a strengthening of the pound vs usd, would putting retaliatory tarrifs of american imports be a feasible way for Reeves to bslance the books with minimal impact on consumers?",
        "replies": [
          {
            "body": "Retaliatory tariffs increase the cost to the domestic consumer of stuff imported from the US - so it takes money out of the economy in the form of a tax. It would help government finances (at least in theory) as they get to keep the value of that tariff but you would be paying 10% more or whatever the tariff is, consequently you'd have less money to spend elsewhere. \n\nHowever the strengthening GDP v the US$ makes US imports more attractive - but any increase in tariff duties would wipe out any gain.",
            "replies": []
          },
          {
            "body": "Apart from a VAT hike, imposing new tariffs is one of the most direct ways to impact consumers. \n\nWhile the pound has strengthened a bit against the dollar so far this year, it is by no means outside of the normal fluctuations that we see in the rate and is still actually weaker than it was in September 2024:\n\n[https://www.xe.com/en-gb/currencycharts/?from=GBP&to=USD&view=10Y](https://www.xe.com/en-gb/currencycharts/?from=GBP&to=USD&view=10Y)\n\nAside from the tariffs themselves, trying to track the dollar-pound rate with tariffs to take advantage of the fluctuations would be chaotic, which would likely make the UK less attractive as a market and ultimately increase prices due to lower supply.",
            "replies": []
          },
          {
            "body": "Although the inflationary impact will be lessened by a strengthening pound it will still have one. Further to that it comes with the risk of the pound falling again which causes inflation to go up again quite significantly, and also America retaliating with further tariffs which puts us back in a worse position than we are currently in. It also puts back any progress on a potential trade deal. \n\nIn theory, it might work, but it is a very high risk strategy that I don't think is tolerable.",
            "replies": []
          }
        ]
      },
      {
        "body": "Wonder if Starmer will hold his nerve when it comes to Donald Trump and the news that tariffs on UK products are likely\n\nI’d then ask how a country can wean itself off of dealing with another economically but when we (I assume) are one of the more bigger exports, predominantly in stuff like cars and steel, and it’s just not feasible",
        "replies": [
          {
            "body": "There's some really good and readable analysis of UK/US trade here: [https://www.ons.gov.uk/economy/nationalaccounts/balanceofpayments/articles/uktradewiththeunitedstates2023/2023](https://www.ons.gov.uk/economy/nationalaccounts/balanceofpayments/articles/uktradewiththeunitedstates2023/2023)\n\nIn particular, the first paragraph of section 3:\n\n>In 2023, the UK imported £57.9 billion of goods from the United States, which accounted for 10.0% of all goods imports, making the United States our second largest import partner, behind only Germany. There were £60.4 billion of goods exports to the United States, making it our largest export partner, accounting for 15.3% of all goods exports.",
            "replies": []
          }
        ]
      },
      {
        "body": "The Trump guy speaking on Newsnight now is horrible!",
        "replies": []
      },
      {
        "body": "So… when is the spring statement?",
        "replies": []
      },
      {
        "body": "Last day to do NI top ups. I'm right in the grey area of whether it's worth doing. I have 4 years unfilled but not quite 40 years old, so still time to fill them by working.\n\nEdit - if I keep working to 55 I'll get full entitlement anyway. Think I'll hang onto my cash.",
        "replies": []
      },
      {
        "body": "Does anyone have any sources of commentary on benefits to the UK of these American tariffs if there was any?",
        "replies": [
          {
            "body": "There is a world where after America has devastated itself we can pick up some of their share of technology and services sectors but we're a long and hard road away from that.",
            "replies": []
          },
          {
            "body": "I think it'd be best to wait till the dust settles. These tariffs are very much subject to change, & economists are pretty poor at forecasting even without these potential changes.",
            "replies": []
          }
        ]
      },
      {
        "body": "BBC headline ATM:\n\n>Council tax and energy bills rise, but minister says minimum wage and pension increases will help\n\n\nWell it won't bloody help me. \n\nI can't even think of the last time any government policy, let alone an economic one, has impacted my life in a positive way. \n\nMaybe when they made it so you didn't need to go to a photo booth for a passport picture?",
        "replies": [
          {
            "body": "Hasn't a government policy been keeping your energy bill down artificially?",
            "replies": []
          }
        ]
      },
      {
        "body": "This will probably get removed as just a rant about local issues but when we do we actually revolt as citizens for putting so much into the system and getting shite back, cause I am getting ready to. \n\n\nMy local council is on its knees. Wants to do black bin collections once a month. But they make us pay for recycling box replacements, or just new ones if you move in and there aren't any. But there's a a shortage. I paid for a food bin 2 months ago and the order got cancelled cause there aren't any, but I didn't get my money back. I pay over £2k/year on council tax. ",
        "replies": [
          {
            "body": "Voters get exactly what they want, pensioner benefits, nhs spending and zero housebuilding.",
            "replies": []
          },
          {
            "body": "I do wish they would skip this charade of pretending they are still in charge of sanitation or really anything outside of wiping old people's bums. \n\nThe quicker we come round to the idea of it being an old age care pension, the quicker it can be reformed.",
            "replies": []
          },
          {
            "body": "Revolting won’t help here, the reasons for councils being absolute dogshit is that they’re basically care home providers that occasionally collect a bin or fill a pothole if you’re lucky. Add this to the element of ‘pay peanuts, get monkeys’ that affects the public sector in general and it’s a wonder councils even function at all.\n\nThe only way councils aren’t going to be breathtaking shit is if we stop forcing them to bear the burden of too many people in need of social care for the number of workers we have to support them. Social care is a garrotte around the country’s finances which is massively worsened by making underfunded councils shoulder it rather than the state itself which actually has the resources to deal with the problem.\n\nA national care service would take the financial boot off the local government sector’s neck and so much of the grotty, decaying feel of the UK would evaporate as councils will be freed up to do council things again rather than providing social care with everything else as an afterthought.",
            "replies": []
          },
          {
            "body": "Okay...but you first.",
            "replies": []
          },
          {
            "body": "It’s not a local issue. Most councils are in that state as they’ve had their central funding slashed over the last 15 years, and they’re legally obligated to cover skyrocketing adult social care bills.",
            "replies": [
              {
                "body": "Or we actually need to redefine what councils are for and what council tax covers, we have a lot of scope creep with our definitions and our expectations.",
                "replies": []
              }
            ]
          },
          {
            "body": "You've just made me remember that I ordered recycling sacks from the council in December and the bastards still haven't delivered them.\n\nI say we march on Westminster.",
            "replies": []
          }
        ]
      },
      {
        "body": "[deleted]",
        "replies": [
          {
            "body": "I appreciate that everyone has missed this not particularly subtle criticism of schools that the show was making!",
            "replies": []
          }
        ]
      },
      {
        "body": "Look, I love collecting bargaining as much as the next quasi public-sector dependant IT professional. However you've got to recognise when a union is actively making things worse for it's members\n\n\nBut let's face it, Unite have really shat the bed in Birmingham.  Promoting the use of violence on its picket lines; not budging from it's initial demands during a negotiation, proving the local leaders don't know what \"negotiation\" means; having senior members of their team leak confidential points from non-prejudice talks.\n\n\nIf I were a member of this particular group, I'd have demanded a change in leadership a long time ago.",
        "replies": [
          {
            "body": "I think a lot of it is the sunken cost fallacy. The union has put so much effort into opposing these reforms, and whipped their members up into such a frenzy, that backing down is difficult. It has gotten so ugly that it is really a case of all or nothing now.  Couple this with the Unite General Secretary not liking the current Labour leadership, and it's a recipe for disaster. The council are clearly fucking over some of their employees, but they're literally bankrupt and have little alternative but to try and balance the books by bringing down their inflated wage bill. \n\nUnite is a particularly wealthy union, so they could fund this pretty much indefinitely. It's hard to see any route to an amicable resolution now given the union members aren't losing much from striking and employer-union relations have collapsed. Birmingham Council will probably be looking to privatise waste collection as the nuclear option now, even on an interim basis at a large enough scale it would effectively neuter the union's bargaining power, albeit it will be less cost effective in the short-term than conceding to the union.",
            "replies": []
          },
          {
            "body": "> Unite have really shat the bed in Birmingham.\n\nWhat's worrying is that I had to read the rest of your comment to work out which specific thing in Birmingham you were on about.  There's also the fraud case that Unite are being investigated on, about the hotel that they were building: https://www.theguardian.com/uk-news/2024/oct/21/sfo-major-investigation-under-way-into-112m-hotel-built-by-unite-union",
            "replies": []
          },
          {
            "body": "Only a public sector union would try and beat an essentially bankrupt employer like this. Anyone else would be too obviously sticking the knife in to their own source of income.",
            "replies": [
              {
                "body": "That’s the issue with public sector unions - they know their employer is unable to properly go bankrupt, so there’s nothing really stopping them from just striking and constantly making unreasonable demands _ad infinitum_.",
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "body": "If it turns out the Australian authorities are correct, I wonder if Prince Andrew will try to use Guiffre's latest fantasism to rehabilitate his own image.\n\n\"If she's lying about this so fragrantly, surely you must believe her accusations about me are lies\"",
        "replies": [
          {
            "body": "Normalise context",
            "replies": []
          },
          {
            "body": "Was there any decent evidence her accusations against him were true, or was it just that he was so vague and uninterested?",
            "replies": []
          }
        ]
      }
    ]
  }
]